["TamingnewsItem","President Donald Trump  nominee's words, according to several familiar with the incident.Sen. Richard Blumenthal said Wednesday that Judge Neil Gorsuch, Trump's nominee, told him he found Trump's attack on a federal judge on Twitter \"disheartening\" and \"demoralizing.\"Within a half-hour, Gorsuch spokesman Ron Bonjean, who was tapped by the White House to head communications for Gorsuch, confirmed that the nominee, Gorsuch, used those words in his meeting with Blumenthal. Several other senators, including Republican Sen. Ben Sasse of Nebraska, later relayed similar accounts of Gorsuch forcefully criticizing Trump's public attacks on the judiciary branch.And on Thursday, Blumenthal said on MSNBC Gorsuch specifically told him he \"should feel free to mention what I said about these attacks being disheartening and demoralizing.\"But none of that stopped Trump from firing off a shot against Blumenthal -- and at the same time raising questions about the coherence of the White House's messaging.Supreme Court nominee Gorsuch calls Trump's tweets 'disheartening'\"Sen. Richard Blumenthal, who never fought in Vietnam when he said for years he had , now misrepresents what Judge Gorsuch told him?\" Trump tweeted Thursday morning.Gorsuch's criticism came in response to Trump's recent criticism of federal judges who have ruled against his immigration ban or appear poised to do so, in particular in reference to one of the President's tweets slamming one of those judges as a \"so-called judge.\"\"The opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned!\" Trump tweeted last Saturday.On Wednesday, Trump pressed forward with his criticism, arguing that the judiciary has become too political and suggesting that judges on the 9th Circuit Court of Appeals might rule against his appeal to reverse a temporary stay on implementing his travel ban because of political considerations, instead of the law.Blumenthal stood by his accounting of Gorsuch's comments, telling CNN's Chris Cuomo on \"New Day\" Thursday morning he \"absolutely and accurately\" stated what Gorsuch told him.\"I think that the President needs to hear from Judge Gorsuch about exactly what he is saying to myself and Senate colleagues,\" Blumenthal said. \"Maybe he simply hasn't been informed and that's the reason for his tweet.\"Former GOP Sen. Kelly Ayotte, who is helping shepherd Gorsuch's nomination on the Hill said in a statement Thursday Gorsuch has told senators \"he finds any criticism of a judge's integrity and independence disheartening and demoralizing.\"Ayotte added the judge has made clear he \"could not comment on any specific cases and that judicial ethics prevent him from commenting on political matters.\" Republican Sen. Ben Sasse of Nebraska also confirmed Thursday that Gorsuch criticized Trump's attacks on the federal judge in a meeting with him as well.Sasse said Gorsuch \"got pretty passionate\" about the topic, particularly when he asked Gorsuch about Trump's \"so-called judge\" tweet.\"This is a guy who welled up with some energy. He said any attack on any brothers or sisters of the robe is an attack on all judges. He believes in an an independent judiciary,\" Sasse said Thursday morning on MSNBC.Trump's dig at Blumenthal's military service is a reference to Blumenthal's past misrepresentations about his service during the Vietnam era.Blumenthal obtained multiple military deferments to avoid getting drafted into the Vietnam War and ultimately landed in the Marine Corps Reserve and never deployed to Vietnam, though he claimed multiple times he had served in Vietnam. Blumenthal apologized for misrepresenting his service in 2010.While Blumenthal enlisted in the Marine Reserve after multiple deferments, Trump -- who was also eligible for the draft during the Vietnam War -- never enlisted, instead obtaining multiple student deferments and ultimately a medical deferment for a bone spur to avoid the military draft.Sen. Chris Coons said in his personal meeting with Gorsuch, he plans to ask the nominee about his commitment to judicial independence given some of the President's recent comments about judges.\"I don't think it's constructive for President Trump to weigh in on this and to level accusations against sitting senators,\" the Delaware Democrat told CNN's Alisyn Camerota on \"New Day.\" \"I frankly think the more he stays out of this the better for his judicial nominee.\"\"But this simply highlights why judicial independence is going to be so important for me and for other Senators as we go through the process of meeting Judge Gorsuch and considering whether or not he should serve on the Supreme Court,\" he added.Trump's Thursday tweet could complicate the upcoming hearings for Gorsuch, who is certain to face questions about Trump's tweets from Democrats. Liberals, already concerned with Gorsuch's record, have also asked how he will demonstrate independence from the President. The President is also set to meet with red state Democrats for lunch, in hopes of wooing their support for Gorsuch.This story has been updated to reflect new reporting.","Updated 1714 GMT  February 9, 2017 ","http:\/\/rss.cnn.com\/rss\/edition.rss","http:\/\/www.cnn.com\/2017\/02\/09\/politics\/donald-trump-neil-gorsuch-democrats\/index.html","job-152791-2-18",1486662181282.0,"cnnbasic","Trump falsely accuses senator of misrepresenting Gorsuch criticism",-1005491394]