["TamingnewsItem","Abraham Lincoln was dead 57 years before the Lincoln Memorial was constructed. George Washington had to wait 89 years after his death before his monument in Washington, DC, was finished. Thomas Jefferson had it the worst, as his memorial didn’t get built until 117 years after he passed away.Donald Trump has been in office less than three weeks and already plans are being drawn up for a statue to memorialize the United States’ 45 president. But there is one catch.The statue will be in a tiny village in central Italy.The mayor of Vagli di Sotto, Mario Puglia, plans to put a big, beautiful marble statue of the sitting U.S. president in the village’s Park of Honor and Dishonor. He thinks it will be a tremendous way to attract tourists from around the globe to the Tuscan town of less than 1,000 people.\"I'm not going to enter into a discussion over whether his actions are right or wrong,\" . \"But at the moment Trump is the only politician who is following through on his promises, doing what he said on the campaign trail.\"Last year, the village saw over 250,000 visitors, but Puglia has yet to mention if he plans to build a wall to control the flow of people into Vagli di Sotto. Puglia added that while he would be honored if Trump made a trip to see the statue, he doubts the U.S. leader will have the time.\"I don't think he will come, because of everything he has to do, but we're in contact with the American ambassador and we want to invite them,” .Work is underway on the statue, which is expected to be ready by the summer, and private donors in both Italy and America have offered around $105,000 to finance it. A photo posted by A N N A  on Trump won’t be alone in the town’s infamous park. The eclectic array of marble-work in the park already features a sculpture of a French police dog killed in a raid after the Paris terror attacks, and two relating to the 2012 Costa Concordia cruise ship disaster. One statue is of the ship's fleeing captain, Francesco Schettino, who is depicted with rabbit ears, while another honors coastguard Captain Gregorio De Falco, who famously told the cowardly captain to get back on board the doomed ship.Last year, the town commissioned a statue of David Bowie shortly after his death. The project, which was funded by private businesses for just under $70,000, was recently completed and is set to be put in the park any day. ","Published\n\t\t            February 08, 2017","http:\/\/feeds.foxnews.com\/foxnews\/internal\/travel\/mixed","http:\/\/www.foxnews.com\/travel\/2017\/02\/08\/italian-village-constructing-giant-marble-statue-donald-trump.html","job-152791-3-13",1486632151426.0,"foxbasic","Fox NewsItalian village constructing giant marble statue of Donald Trump",-1018909108]