["TamingnewsItem"," Republican presidential front-runner Donald Trump said on Wednesday that women who end pregnancies should face punishment if the United States bans abortion, triggering a torrent of criticism from both sides of the abortion debate, including from his White House rivals. After MSNBC broadcast a clip of an interview with Trump, the billionaire businessman rowed back his remarks, first saying that the abortion issue should be handled by states and later that doctors who performed abortions should be the ones held responsible.  \"The doctor or any other person performing this illegal act upon a woman would be held legally responsible, not the woman,\" Trump said in his last statement. \"The woman is a victim in this case as is the life in her womb.\" Trump's earlier statements drew heavy fire from abortion rights supporters and opponents alike. Abortion has long been a divisive issue in American politics, even though the procedure was legalized in a Supreme Court ruling more than 40 years ago. Opposition to abortion has become a central plank in the platform of most conservative politicians.  Trump has won support from Republican voters for selling himself as a Washington outsider. But the New York real estate tycoon, who once supported abortion access, has come under pressure from conservatives to prove he is truly one of them. At the same time, he has drawn criticism for comments that offended women and minority groups. \"Of course, women shouldn't be punished,\" rival Republican candidate John Kasich said on Wednesday, saying he opposed abortion except in specific cases such as rape.  U.S. Senator Ted Cruz of Texas, the third candidate for the Republican nomination for the Nov. 8 election, said Trump had not thought through the issue. \"What's far too often neglected is that being pro-life is not simply about the unborn child, it's also about the mother,\" he said in a statement. DISCORD AMONG THE REPUBLICANS Abortion rights supporters were equally incensed. \"What Donald Trump said was outrageous and dangerous. I'm constantly taken aback at the kinds of things that he advocates for,\" Democratic front-runner Hillary Clinton told MSNBC. \"Once again, he has showed us who he is.\" Dawn Laguens of the Planned Parenthood Action Fund, the political arm of the women's health group, called Trump \"flat-out dangerous\" in a statement. Abortion was legalized in the United States in 1973, when the Supreme Court declared that a woman's constitutional right to privacy protected her decision to end a pregnancy.  In the decades since, there have not been enough votes on the Supreme Court to reverse the ruling, but numerous states have passed laws aimed at restricting abortion. In the MSNBC interview, which is to air in full later on Wednesday, Trump said if the United States banned abortion, some women would seek to end pregnancies illegally. \"There has to be some form of punishment,\" he said. Asked what form he would advocate, Trump said: \"That I don't know.\" Anti-abortion groups said Trump's comments were at odds with their own stance. \"In all the positions the U.S. Conference of Catholic Bishops has taken around the issue of abortion, they have not called for punishment of women who've had abortions,\" said Don Clemmer, a spokesman for the group. After the backlash started, Trump's campaign sought to moderate his view. \"This issue is unclear and should be put back into the states for determination,\" Trump said in a statement provided to Reuters by email. Later, Trump walked back his comments further to say doctors, not women, should be responsible. The dust-up was evidence of further discord among Republicans over Trump's candidacy. On Tuesday, both Trump and Kasich, the Ohio governor, abandoned pledges to support the party's eventual nominee. Cruz did not explicitly abandon the pledge but said Trump would not be the nominee. Trump had already outraged many women after he said Fox News' Megyn Kelly had \"blood coming out of her eyes, blood coming out of her wherever\" when she asked tough questions in a televised debate, which many saw as a reference to menstruation. According to a Reuters\/Ipsos poll in March, 66 percent of all likely women voters said they had an \"unfavorable\" view of Trump. But among the 460 Republican women who responded to the poll, 62 percent had a \"favorable\" view of him, while 38 percent did not. In other remarks that have set off furious reactions, Trump has called illegal immigrants from Mexico criminals and rapists and has pushed for a temporary ban on Muslims entering the United States.  In Wednesday's MSNBC interview, Trump said he would not rule out the possibility of using nuclear weapons to combat Islamic State militants. \"I would never take any of my cards off the table,\" he said.      ","Thu Mar 31, 2016 | 9:03am EDT",null,null,null,"scrapetime","source","Trump sounds off on abortion; criticism comes from all sides","reutersbasic",-1011072718]