["TamingnewsItem","Our Terms of Service and Privacy Policy have changed.How's this for déjà vu? Another debt crisis is brewing in Europe. Greece needs European creditors to release cash from a bailout agreed in 2015 so it can make debt repayments, but officials are at loggerheads. Investors are starting to worry, demanding higher returns on Greek debt.  Adding to the confusion is a warning from the International Monetary Fund that Greece's debt is unsustainable and on an \"explosive\" path, an assessment that prevents the fund from participating in a rescue.  The timing could hardly be worse. European leaders have a lot on their plate. Elections are looming in the Netherlands, France and Germany. Brexit negotiations will begin within weeks.  Yet the threat of Greece tumbling out of the euro demands attention. Here's why the next few weeks will be key:  Hammer to fall  Greece is running out of cash, but it needs to make repayments to creditors including the European Central Bank. Major bills are coming due in July.  If Greece cannot make the payments, it will default on its debt and spiral out of the eurozone.  Meanwhile, its latest bailout -- the third since 2010 -- is effectively frozen. The negotiating positions of major players are further apart than at any point since the bailout was agreed in June, 2015.  There is even disagreement over the size of the problem facing Greece.  \"The IMF's latest review of Greece's debt position was surprisingly pessimistic,\" said Jeroen Dijsselbloem, the Dutch finance minister who chairs meetings of top eurozone finance officials. \"It's surprising because Greece is already doing better than that report describes.\"  I want it all  The IMF, Greece and creditors led by Germany all have very different priorities. Here's what each wants:  The IMF has called on Greece to make more ambitious changes to its economy, including labor market reforms. The IMF didn't join the third bailout when first agreed in 2015 because it did not view Greece's debt as being sustainable. It still maintains that Greece cannot be self sustaining without major debt relief.  Greece's main creditors agree that Athens should implement the reforms proposed by the IMF. However, they have categorically ruled out any debt relief, a position reiterated by eurozone finance officials on Tuesday.  Greek Prime Minister Alexis Tsipras, meanwhile, shows no sign of yielding to demands for additional reforms. He insists that debt relief is needed before any new concessions are made.  It's a classic standoff and investors are watching to see which party blinks first.  Put out the fire  The next major milestone is a meeting of eurozone finance ministers on Feb. 20 -- the last before elections start muddying Europe's political waters. Agreeing yet more financial aid for Greece will become even harder once voters start casting their ballots.  After that, bills will start coming due. Greece faces a payment to the ECB of roughly €1.4 billion in late April and another €4.1 billion in July.  The stake are high.  The unemployment rate in Greece is expected to run above 21% in 2017. Investment is down by more than 60% and output has contracted by more than 25% since the financial crisis. The country's social fabric is fraying.  If European creditors refuse further help, Greece's debt will spiral out of control no matter how quickly its economy grows, according to the IMF.  That will leave only one option -- abandoning the euro.  Ted Malloch, President Trump's expected choice for U.S. ambassador to the EU, told Greek television on Tuesday that the eurozone's future would be decided in the next 18 months.  \"Certainly there will be a Europe, whether the eurozone survives, I think it's very much a question that is on the agenda,\" he said. \"I think this time I would have to say that the odds are higher that Greece itself will break out of the euro.\" "," February 8, 2017: 12:27 PM ET ","http:\/\/rss.cnn.com\/rss\/money_news_international.rss","http:\/\/money.cnn.com\/2017\/02\/08\/news\/economy\/greece-imf-bailout-eurozone\/index.html?section=money_news_international","job-152791-2-16",1486601351265.0,"cnnbasic","The last thing Europe needs: another Greek crisis",-1017463481]