["TamingnewsItem","Another high-profile Trump administration official has made statements about a terror attack that never occurred.   This time, it's Press Secretary Sean Spicer. Three times in one week, Spicer alluded to a terror attack in Atlanta by someone from overseas. But the last high-profile terror attack in Atlanta was, 21 years ago. And that bombing was carried out by , a radical right-wing terrorist from Florida -- not a foreign-inspired terrorist. So what exactly did Spicer say about Atlanta? Here's what Spicer told ABC's \"\" on January 29 while defending the President's travel ban: \"What do we say to the family who loses somebody over a terroristic  -- to whether it's Atlanta or San Bernardino or the Boston bomber? Those people, each of whom had gone out to a country and then come back,\" Spicer said. The next day, Spicer appeared on MSNBC's \"\" and also mentioned Atlanta while defending the travel ban: \"There was a very short period of time in which we had something to execute that ensured that the people of the United States were safe. Everybody's been protected,\" Spicer said. \"What happened if we didn't act and somebody was killed? ... Too many of these cases that have happened -- whether you're talking about San Bernardino, Atlanta ... Boston ... would you wait until you do? The answer is we act now to protect the future.\" And in his January 30 press briefing, Spicer once again alluded to an Atlanta terror attack. When asked by a reporter why some countries linked to terrorism aren't on the travel ban list, Spicer responded:\"Right, and we're reviewing the entire process over this period of time to make sure that we do this right. But I don't think you have to look any further than the families of the Boston Marathon, in Atlanta, in San Bernardino to ask if we can go further.\" Spicer's trio of comments were linked by The Daily Beast. It's still not clear what Atlanta terror attack Spicer was referring to. CNN tried to reach Spicer all day Wednesday,  asking what he meant by his Atlanta comments and whether he misspoke and was actually referring to the . As of late Wednesday afternoon, Spicer has not responded to CNN's requests for comment.On Wednesday, Atlanta police spokeswoman Elizabeth Espy said the department is not aware of any recent terror attacks. \"From what we can recall, the last known terrorist attack in the state was 1996 in which Eric Rudolph was implicated,\" she told CNN in an email.  As for Islamist terror attacks, \"We have no record of an Islamic attack in the City of Atlanta.\" FBI Special Agent in Charge Steve LeValley also said there has not been an Islamist terror attack in Atlanta. He said the last terror attack of any sort in Atlanta was in 1997, . Rudolph, the Olympic Park bomber, . Last week, top White House adviser Kellyanne Conway also defended the travel ban by citing the \"Bowling Green massacre\" in Kentucky. But no such massacre ever occurred. In an interview with CNN's Jake Tapper,  for not covering the \"Bowling Green massacre.\"\"I regretted it tremendously,\" . \"I felt really badly about that.\"The administration's unsubstantiated references to an Atlanta terror attack and the false claim of a \"Bowling Green massacre\" came after Trump accused CNN of reporting \".\" But Conway doesn't agree with that claim.\"I don't think CNN is 'fake news,' \" . \"I think there are some reports everywhere, in print, on TV, on radio, in conversation, that are not well-researched and are sometimes based on falsehoods.\" CNN's MaryLynn Ryan, Eli Watkins and Brian Stelter contributed to this report. ","Updated 6:12 PM ET, Wed February 8, 2017 ","http:\/\/rss.cnn.com\/rss\/edition.rss","http:\/\/www.cnn.com\/2017\/02\/08\/politics\/spicer-alleged-atlanta-terror-attack-trnd\/index.html","job-152791-2-16",1486601809797.0,"cnnbasic","Sean Spicer cites Atlanta terror attack that never happened",-1027216052]