["TamingnewsItem"," – People tend to become less involved with community work and social groups as they age, but those who were most active in their high school years are the most likely to stay engaged as they age, researchers say. Youth may be an important time for people to develop a sense of themselves as contributing to society, and this identity may last throughout life, the study team writes in The Journals of Gerontology: Social Science. There are many benefits to being involved in a community, including more social relationships, greater cognitive engagement and better health, lead author Emily Greenfield, an associate professor of social work at Rutgers University in New Brunswick, New Jersey, told Reuters Health. “Participation in voluntary groups is thought to be especially important for older adults, who are more likely to lack other major social roles  and who might face economic and health barriers that jeopardize their inclusion within their communities,” Greenfield said by email. “Encouraging young people to become civically engaged is important not just for the here-and-now, but might have effects that last over decades to come,” she said. To see whether early participation in voluntary groups is related to social engagement later in life, Greenfield and a colleague used data from a study that followed Wisconsin’s 1957 high school graduates through the age of 72.  The study checked in with participants at ages 36, 54, 65, and 72 years and asked about their involvement with various community groups, such as church groups, labor unions, parent-teacher associations, sports teams, political groups and charity or welfare organizations. The study team also used data from high school yearbooks to determine whether participants were involved in volunteer activities, clubs and sports earlier in life. On average, they found, participation in volunteer organizations and other groups was highest in midlife and declined when people reached their 60s and early 70s. Community participation increased most rapidly between ages 36 and 45 and continued increasing until about age 54. At 54, participation began to decline and the lowest levels of community participation were among 72 year-olds. People who were involved in extracurricular activities in high school were more likely to stay involved throughout their lives, particularly if they had done four or more activities when they were young. They also had less of a decline in participation between middle age and older age.  “Communities that need volunteers often do not consider the value that older adults offer,” said Dawn Carr, an assistant professor of sociology at Florida State University who studies aging populations and community participation. The study’s measurements may not fully capture older people’s involvement, as they emphasized how many groups people were involved in, while older adults may tend to narrow their focus, said Carr, who was not involved in the study.  “Previous research suggests that we engage in fewer organizations but contribute more time to the organizations in which we are engaged,” Carr told Reuters Health by email. Organizations or communities that give older people a chance to be valuable and learn new skills are more likely to keep them engaged, Carr noted. SOURCE: bit.ly\/2jtJX06 The Journals of Gerontology: Sociology, online January 19, 2017.","Fri Feb 3, 2017 | 11:15am EST",null,null,null,"scrapetime","source","Extracurricular activities in youth tied to social engagement later in life","reutersbasic",-102237161]