["TamingnewsItem","\"When I woke up I didn't know that I was in China.\" Lan remembers the night that changed her whole life. While preparing for university along the border in northern Vietnam, a friend she met online asked her to a group dinner. When she was tired and wanted to go home, the people asked her to stay and talk and have a drink. Next thing she knew, she had been smuggled across the border to China.  \"At that time, I wanted to leave,\" says Lan. \"There were other girls there in the car but there was people to guard us.\"  The villages along the Vietnamese-Chinese border are a hunting ground for human traffickers. Girls as young as 13 say they are tricked or drugged, then spirited across the porous border by boat, motorbike or car. Young Vietnamese women are valuable commodities in China, where the one-child policy and long-standing preference for sons has heavily skewed the gender ratio.  To put it simply, Chinese men are hungry for brides.  \"It costs a very huge amount of money for normal Chinese man to get married to a Chinese woman,\" explained Ha Thi Van Khanh, national project coordinator for the U.N.'s anti-trafficking organization in Vietnam. Traditionally, Chinese men wishing to marry local women are expected to pay for an elaborate banquet and to have purchased a new home to live in after the wedding.  \"This is why they try to import women from neighboring countries, including Vietnam.\"   Diep Vuong started the Pacific Links Foundation to combat trafficking in Vietnam. She says that Vietnamese brides can sell for upwards of $3,000 to the end buyer and that they are often considered desirable because of cultural similarities to the Chinese.   Nguyen was just 16 when a friend's boyfriend drugged her and smuggled her into China. She tried to resist a forced marriage. For three months, she refused, even though her traffickers beat her, withheld food and threatened to kill her, she says. Finally, she relented. She says her husband was kind to her, but she never stopped missing her family in Vietnam.   \"My desire to go home was indescribable,\" Nguyen said. \"I agreed to marry the man but I could not stay with a stranger without any feelings for him.\"  When her mother-in-law realized Lan was never going to warm to the marriage, the family returned her to the traffickers. They got their money back, Nguyen says, after which she was forced into a second marriage.   The Pacific Links Foundation runs a shelter for trafficking victims in the city of Lao Cai, northern Vietnam. The young women stay for an average of two to three years. They go to school or get vocational training. They do art therapy. They learn to cook and sew and keep a big garden. Surrounded by other woman with similar experiences, the shelter helps them get back on their feet and then to find jobs to support themselves.  \"Once that whole investment process can happen with these young women then it is much easier for them to have their own lives,\" says Diep. Her organization also does community outreach to try and stop more girls from falling into the hands of traffickers. About once a month, a group of trafficking victims visits the market at Bac Ha, a regional hub for buying food, fabric and livestock. On this day, on a stage overlooking hundreds of shoppers, they talk about their experiences, take questions and play games with the crowd. When they ask people to share personal experiences concerning trafficking, more than 20 people come forward.   \"I think awareness is the only tool,\" Diep says. Ha from the U.N. agrees that the top priority is to spread awareness, especially in the poor, rural regions along the border. She also believes reducing poverty will help stop women going to China seeking work, another common way traffickers lure victims.During CNN's trip to the border, the government called and told us the police had just rescued five girls as they were about to cross the border with a trafficker. We met the girls, who are just 14 years old. They said they were promised $600 to go to work in China by a neighbor from the same village. They didn't tell their parents they were going. The neighbor is now under arrest.  The Vietnamese police are sometimes able to rescue women even after they have crossed into China, by enlisting the help of Chinese authorities. Nguyen Tuong Long, the head of the government's social vice prevention department in Lao Cai, says last year they rescued and returned 109 Vietnamese trafficking victims.\"Because of cooperation between the Vietnamese and the Chinese police, we have found and caught trafficking rings,\" Nguyen says. \"We've found women far inside China, at brothels where they're forced to become sex workers.\"  Trafficked women who aren't rescued in raids have to find ways to get out on their own.  Some of them say they were able to contact their families from China, but they couldn't get help from police because they didn't know exactly where they were.  Lan and Nguyen ended up in the same town in China. After two years, together they managed to slip out of their homes and take a taxi to a local police station. The whole time they were afraid their husbands' families would find them. The Chinese police investigated and eventually returned them to Vietnam.  The women were free of their forced marriages, but they paid a high price. Both left their babies in China. Lan says if she saw her daughter again, she would apologize for leaving her behind. \"I hope she'll have a better life there,\" she says.  Both Lan and Nguyen say in school their teachers had talked to them about trafficking. At the time, neither believed it could happen to them.","Updated 1002 GMT  April 19, 2016 ","job-152791-2-9","job-152791-2-9","job-152791-2-9",1486425467529.0,"cnnbasic","Vietnamese girls smuggled into China and sold as child brides",-1021165646]