["TamingnewsItem","A six-month stay on the International Space Station can be a pain in the back for astronauts. While they may gain up to 2 inches in height temporarily, that effect is accompanied by a weakening of the muscles supporting the spine, according to a . Astronauts have been reporting back pain since the late 1980s, when space missions grew longer. Their flight medical data show that more than half of US astronauts have reported back pain, especially in their lower backs. Up to 28% indicated that it was moderate to severe pain, sometimes lasting the duration of their mission. Things don't improve when they return to Earth's gravity. In the first year after their mission, astronauts have a 4.3 times higher risk of a herniated disc. \"It's sort of an ongoing problem that has been a significant one with cause for concern,\" said Dr. Douglas Chang, first author of the new study and associate professor of orthopedic surgery and chief of physical medicine and rehabilitation service at University of California San Diego Health. \"So this study is the first to take it from just an epidemiological description and look at the possible mechanisms for what is going on with the astronauts' backs.\"Much attention has been focused on intervertebral discs, the spongy shock absorbers that sit between our vertebrae, as the culprit for the back issues that astronauts face. But the new study runs counter to that thinking. In this research, funded by NASA, Chang's team observed little to no changes in the discs, their height or swelling. What they did observe in six astronauts who spent four to seven months on the ISS was a tremendous degeneration and atrophying of the supporting musculature in the lumbar  spine, Chang said. These muscles are the ones that help us stay upright, walk and move our upper extremities in an environment like Earth, while protecting discs and ligaments from strain or injury. In microgravity, the torso lengthens, most likely due to spinal unloading, in which the spinal curvature flattens. Astronauts also aren't using the muscle tone in their lower backs because they aren't bending over or using their lower backs to move, like on Earth, Chang said. This is where the pain and stiffening occurs, much like if the astronauts were in a body cast for six months. MRI scans before and after the missions revealed that the astronauts experienced a 19% decrease in these muscles during their flight. \"Even after six weeks of training and reconditioning here one Earth, they are only getting about 68% of their losses restored,\" Chang explained.Chang and his team consider this a serious issue for long-term manned missions, especially when considering a trip to Mars that could take eight or nine months just to reach the Red Planet. That trip, and the astronauts' potential time spent in Martian gravity -- 38% of the surface gravity on Earth -- creates the potential for muscle atrophy and deconditioning.The team's future research will also look at reported neck issues, where there can be even more occurrences of muscle atrophy and a slower recovery period. They are also hoping to partner with another university on inflight ultrasounds of the spine, to look at what happens to astronauts while they are on the space station.Because nobody likes back pain and muscle loss, Chang suggested countermeasures that should be added to the already two- to three-hour workout astronauts have on the space station each day. Though their exercise machines focus on a range of issues including cardiovascular and skeletal health, the team believes that space travelers also need to include a core-strenghtening program focused on the spine. In addition to the \"fetal tuck\" position astronauts use in microgravity to stretch their lower back or alleviate back pain, Chang suggested yoga. But he knows that is easier said than done. \"A lot of yoga depends on the effects of gravity, like downward dog, where a stretch through the hamstring, calf muscles, back of the neck and shoulders are possible because of gravity. When you remove that, you may not have the same benefit.\" Any machines on the space station also have to be designed with regards to weight, size and even the reverberations they could produce on the station. Chang and the other researchers brainstormed with a virtual reality team about different exercise programs that would enable astronauts to invite friends, family or even Twitter followers to join them in a virtual workout, making the daily repetition of their workouts more fun and competitive.One of Chang's teammates has felt this pain personally.  is the only astronaut to summit Mount Everest. He experienced a herniated disc after returning from the ISS to Earth. Less than a year later, when he attempted to climb Everest the first time, he had to be airlifted off. After a rehabilitation process, he eventually made the summit. Now, he speaks to current astronauts about the ways they can contribute to studies about their health in microgravity. Keeping the astronauts healthy and fit is the least they can do, Chang said.\"When a crew comes back, they say on one side of the space station, they see this beautiful blue planet,\" he said. \"Everything they hold dear to them is on this fragile little planet. And they look out the other window and just see infinity stretching off into the blackness, and they come back with a different sense of themselves and their place in the universe.\"All of them are committed to furthering space knowledge and making incremental steps forward in any way they can for the next crew.\"","Updated 1609 GMT  October 26, 2016 ","job-152791-2-8","job-152791-2-8","job-152791-2-8",1486422528529.0,"cnnbasic","Going to space is a real pain in the back",-1021605655]