["TamingnewsItem","As the tornado flung her through the air, Amanda Stockfelt held tightly to her newborn daughter in a car seat, floating above in the vortex. The New Orleans mother and her 8-week old Autumn survived the tornado that ripped apart trailers, peeled off roofs and damaged hundreds of properties in a roughly 2-mile path in an eastern New Orleans neighborhood on Tuesday. Stockfelt recounted her few minutes of terror in an interview Thursday with HLN's Erica Hill. Some quick thinking, a mother's intuition, and panic may have saved her baby.\"All I could think of was don't let go of her car seat because if I let go of her car seat, I just knew the tornado was going to take her,\" Stockfelt said. \"And I would never be able to find her.\"The tornado that touched down in New Orleans was one of seven that carved a wide swath spanning at least six parishes in southeastern Louisiana, officials said. No one was killed in the storm system. More than 300 structures were damaged.  NASA's Michoud Assembly Facility in New Orleans was among the damaged structures.Stockfelt said she was working at her desk in a trailer at an impound lot near the NASA facility when the tornado struck. She usually doesn't bring Autumn to work but that day she did because she planned to leave early and take the baby to a doctor's appointment   Stockfelt was cradling her daughter when she heard a rumbling noise. It sounded like a \"freight train,\" she told .\"I really didn't even have time to think,\" Stockfelt told HLN. \"And I knew that if something was going to happen, I wouldn't be able to fully protect her.\"So, she strapped the baby in her car seat and put her underneath her desk, she told WVUE. Stockfelt crawled under the desk as well, and locked her arms around the car seat's handle.A co-worker huddled under the desk, too, and grabbed onto Stockfelt.Then, the trailer started coming apart. \"We flipped over backwards,\" Stockfelt told WVUE. \"And then it's like the trailer exploded, and me and the baby went flying through the air. And I saw the sky, the inside of the vortex. I saw her in her car seat above my head, and then we hit the ground.\"Stockfelt told HLN her co-worker had gripped a ladder wedged underneath a car to prevent her from being blown away.   The moment was surreal, Stockfelt said. \"I couldn't think, I couldn't' do anything.\" When the storm passed, Stockfelt took Autumn out of the car seat, and the baby opened her eyes. \"I had to wipe her face because she had dirt and rain, everything all over her face and she was just looking around,\" Stockfelt said. \"She would not cry.\"\"Did it scare you?\" HLN's Hill asked.\"That terrified me because I didn't know if she had any ... internal injuries that was preventing her from making sounds,\" Stockfelt said.But Autumn survived with only a scratch on her arm. Stockfelt, too, had a scratch but on her forehead.She cradled her daughter on Thursday during the HLN interview -- just like she was doing before she heard the wind howling two days before.  Strangers who heard her story have reached out to her offering new car seats and other assistance. Stockfelt said the outpouring is humbling.\"I'm nobody special. I'm a mom from New Orleans,\" she said. \" I didn't do anything that any other parent wouldn't have done,\" she said. ","Updated 6:21 PM ET, Thu February 9, 2017 ","http:\/\/rss.cnn.com\/rss\/cnn_latest.rss","http:\/\/www.cnn.com\/2017\/02\/09\/us\/tornado-new-orleans-survivor\/index.html","job-152791-2-19",1486687819068.0,"cnnbasic","Quick-thinking New Orleans mom saves daughter in tornado ",-1028794156]