["TamingnewsItem","The Walt Disney Company is once again coming to the rescue of its only theme park in Europe. Disney  said Friday that it will increase its stake in Euro Disney to 85.7% from 76.7%. It is also offering to buy the rest of the company for €2 per share, bringing the potential value of the transaction to €356 million .  Disney said it will also pump up to €1.5 billion  into the park to \"address its financial needs.\"  Since opening in 1992, Disneyland Paris says it has become Europe's top tourist attraction by visitor numbers. But it struggled with huge debts and weak attendance in the aftermath of Europe's debt crisis.  A series of terror attacks in Paris have increased pressure on the park.  Disney said Friday that the operation's financial position has been \"significantly and negatively impacted\" by the November 2015 terror attacks in Paris and what it described as \"challenging business conditions\" in Europe.  Paris shooting: New scare for French tourism  The number of visitors to the theme park dropped to 13.4 million in 2016, from 14.8 million the previous year. Hotel occupancy rates and average spending per rooms have also declined.  Disney has been forced to bail out the struggling theme park at least three times. In 2014, it invested €1 billion  into the park as part of an effort to develop new attractions and hotels.  Data from the UN's World Tourism Organization show international visitor numbers to France fell by about 5% in the first nine months of 2016. Traveler spending in the country also slumped 6.6% in 2016.  If travelers continue to shun France in favor of other destinations, it could soon be overtaken by the United States as the world's most popular tourist destination. The country has been in an official state of emergency since the November 2015 attacks. "," February 10, 2017: 9:53 AM ET ","http:\/\/rss.cnn.com\/rss\/money_news_international.rss","http:\/\/money.cnn.com\/2017\/02\/10\/media\/euro-disney-bailout-disneyland-paris\/index.html?section=money_news_international","job-152791-2-22",1486775607610.0,"cnnbasic","Disney bails out European theme park again with $2 billion",-1021465743]