["TamingnewsItem","A 9-year-old Georgia girl who loves playing with her American Girl dolls has started a bead bracelet business in the hopes of raising enough money to donate special dolls to cancer patients. Bella Fricker, who has more than a dozen of the dolls herself, first noticed the special dolls while flipping through an American Girl magazine, Fox 5 Atlanta reported.The company designed the dolls for children undergoing cancer treatment or suffering from hair-loss conditions.“We were going to give it to a little girl that is going through chemo,” Bella told Fox 5 Atlanta.But after seeing the $115 special-order price tag, Bella began brainstorming for a way come up with extra funds.“I go upstairs, and she’s busted out this table, and put up a sign,” Valerie Fricker, Bella’s mother, told Fox 5 Atlanta. “And I said, ‘What are you doing?’ and she said, ‘Oh I started a business.’”Bella has sold more than 500 of her beaded bracelets for up to $6 each, and her mom  to help spread the word, Fox 5 Atlanta reported. She also joined “Kids Boost,” a local non-profit that helps children fundraise.Bella’s proceeds have gone toward buying three dolls so far, one of which went to Norah Adjakpo, who has been battling a brain tumor since April at Children’s Healthcare of Atlanta’s AFLAC Cancer Center, Fox 5 Atlanta.Bella surprised 8-year-old Norah with a doll around Christmas, and it now accompanies her to appointments and treatment sessions.“If I have her with me, it’s going to be better,” Norah told Fox 5 Atlanta. “I don’t have to worry about my hair being lost. Because  I don’t have hair, and she doesn’t have hair.” ","Published\n\t\t            February 09, 2017","http:\/\/feeds.foxnews.com\/foxnews\/health","http:\/\/www.foxnews.com\/health\/2017\/02\/09\/georgia-girl-donates-bald-american-girl-dolls-to-cancer-patients.html","job-152791-3-16",1486717852910.0,"foxbasic","Fox NewsGeorgia girl donates bald American Girl dolls to cancer patients",-1023659456]