["TamingnewsItem","The mother of a slain British backpacker has written a scathing letter to US President Donald Trump after her daughter's killing in Australia appeared on the White House's list of 78 underreported terror attacks.\"My daughter's death will not be used to further this insane persecution of innocent people,\" Rosie Ayliffe wrote in a statement Mia Ayliffe-Chung, 21, was stabbed to death in Queensland in August along with fellow backpacker Tom Jackson, 30.Australian police  as a motive for the killing.\"The possibility of Mia and Tom's deaths being consequent to an Islamic terror attack was discounted in the early stages of the police investigation... Any fool can shout Allahu Akbar as they commit a crime,\" Rosie Ayliffe wrote in her statement.CNN did not report on Ayliffe-Chung's death at the time after terrorism was ruled out.On Monday, Trump attacked the media for  on incidents on terrorism worldwide.Later, the White House distributed a list of 78 \"major\" terror attacks since September 2014, which it said were either executed or inspired by ISIS and didn't receive adequate press attention.Media outlets have responded with numerous examples of stories on the attacks; CNN covered  on the list.Trump is fighting legal challenges to his  that restricts access to the United States to citizens from seven Muslim-majority countries for 90 days and all refugees for 120 days.In her statement, Rosie Ayliffe called out what she saw as the \"vilification\" of entire states or religions.\"Treating immigrants as disposable commodities and disregarding their safety causes deaths throughout our so-called civilized world.\"\"I have lived and worked in the Islamic world for a number of years ... Mia traveled in Turkey and Morocco too, albeit too briefly,\" she wrote.\"We encountered nothing but respect and hospitality from people who are committed to courtesy and honoring their fellow human beings. This vilification ... is a terrifying reminder of the horror that can ensue when we allow ourselves to be led by ignorant people into darkness and hatred.\"The Trump administration has not responded to Ayliffe. CNN has reached out to her for further comment.","Updated 1933 GMT  February 8, 2017 ","http:\/\/rss.cnn.com\/rss\/edition_world.rss","http:\/\/www.cnn.com\/2017\/02\/08\/europe\/trump-british-backpacker-murder\/index.html","job-152791-2-16",1486602020870.0,"cnnbasic","Mother of slain backpacker writes angry letter to Trump over terror list",-1027049871]