["TamingnewsItem"," A former Morgan Stanley wealth manager in New Jersey has been criminally charged with stealing about $5 million from clients, and then going on a spending spree including private jet service, luxury cars, and country club memberships. Barry Connell, 50, was arrested early Friday in Henderson, Nevada, a Las Vegas suburb, and charged with wire fraud and aggravated identity theft, according to the office of U.S. Attorney Preet Bharara in Manhattan. The U.S. Securities and Exchange Commission filed related civil charges against Connell, a resident of Chester, New Jersey. A lawyer for Connell could not immediately be identified. No one could be reached at the defendant's home for comment. Morgan Stanley is not named in court papers, but a person familiar with the matter said it was Connell's employer for the period in question. The bank was not accused of wrongdoing. Authorities said Connell, who worked in a Morgan Stanley office in Ridgewood, New Jersey, stole money from accounts belonging to a married couple and their daughter from December 2015 to November 2016. Connell made more than 100 unauthorized transfers, but told his employer that he had client permission, authorities said. Much of the money went to funding his \"lavish lifestyle,\" which also included a rental home in Henderson, the authorities said. Morgan Stanley fired Connell in November, citing his alleged unauthorized withdrawals from client accounts for his own apparent benefit, brokerage industry records show. \"We have been cooperating with law enforcement regarding this matter,\" the bank said in a statement on Friday. Before joining Morgan Stanley in 2008, Connell worked for a decade at UBS Group AG, industry records show. The cases are U.S. v. Connell, U.S. District Court, Southern District of New York, No. 17-mag-00694; and SEC v. Connell in the same court, No. 17-00831.  ","Fri Feb 3, 2017 | 3:09pm EST",null,null,null,"scrapetime","source","U.S. charges fired Morgan Stanley wealth manager with theft","reutersbasic",-1027612283]