["TamingnewsItem","Billionaire charter school advocate Eli Broad sent a letter to Senate leaders on Wednesday calling for them to oppose President Donald Trump's choice for education secretary, Betsy DeVos.In the letter written to Senate Majority Leader Mitch McConnell and Minority Leader Chuck Schumer, Broad said he watched DeVos' confirmation hearing with \"dismay\" and listed several of his top concerns with her nomination.\"I believe she is unprepared and unqualified for the position,\" Broad wrote in his letter .Broad's letter opposing DeVos, a fellow billionaire, comes as her nomination faces a series of hurdles. First, she was accused of  written answers provided for her confirmation process, and then on Wednesday two Republican senators  they would not support her.DeVos has made a name for herself as a major donor to Republican causes, including Trump's campaign, and has been especially focused on \"school choice\" initiatives, which are geared towards steering public schooling dollars to vouchers for charter schools.The  has poured millions into charter school programs and advocated on their behalf. A transparency tool for California politics produced by the Center for Investigative Reporting shows Broad has  to both Democrats and Republicans. Although Broad and DeVos support controversial changes to the education system, his letter implied DeVos did not champion strong accountability for charter programs.\"Before Mrs. DeVos's hearing, I had serious concerns about her support for unregulated charter schools and vouchers as well as the potential conflicts of interest she might bring to the job,\" Broad wrote, adding that after seeing her hearing his concerns were redoubled.He also called into question DeVos' willingness to work for equality across the nation's schools, saying the country needs an education secretary who will defend \"the rights of all students.\"Additionally, Broad took issue with DeVos' support for allowing some schools to choose whether they want to be gun-free or not. Broad has  the gun control advocacy organization Everytown for Gun Safety, and DeVos  her openness to guns in the classroom during her confirmation hearing.","Updated 0238 GMT  February 3, 2017 ","job-152791-2-9","job-152791-2-9","job-152791-2-9",1486425341272.0,"cnnbasic","Charter advocate: DeVos 'unprepared and unqualified'",-1038286469]