["TamingnewsItem","Kanye West deleted all of his tweets defending his  sometime between Sunday night and Monday morning.West, who met with Trump at Trump Tower in December, explained his meeting with the then-President-elect in the series of now-deleted tweets amid intense backlash from fans and friends like John Legend. \"I wanted to meet with Trump today to discuss multicultural issues,\" West tweeted on December 13.\"These issues included bullying, supporting teachers, modernizing curriculums, and violence in Chicago,\" he added.\"I feel it is important to have a direct line of communication with our future President if we truly want change,\" he continued in a third tweet.As criticism mounted, West  a day later when he tweeted a picture a signed copy of TIME Magazine's \"Person of the Year\" issue with Trump on the cover.\"To Kanye You are a great friend Thanks,\" the front cover reads, followed by Trump's signature.This tweet has also been deleted.West's representatives did not immediately respond to a CNN request for comment.Last week, Long Island rapper King Myers, a new signee to West's G.O.O.D. music label, released \"Propaganda,\" -- an anti-Trump anthem produced by West that calls for the impeachment of the new President and voices solidarity with refugees, immigrants and Muslims.Previously, a source with knowledge of West's meeting with Trump told CNN that the rapper's main concern is the state of his hometown, Chicago.\"Finding ways to effect change for that particular issue has been heavy on Kanye's mind for years and he has been talking about it more often most recently with family and friends,\" the source said. \"His hope is that he will be able to keep this issue fresh on the mind of the Trump administration and they will make making Chicago safe again a priority.\"West, who was hospitalized in November due to exhaustion, shocked fans in California when he abruptly ended a concert with a rant in which he proclaimed that if he had voted, he would have voted for Trump.\"I told y'all I didn't vote, right?\" Kanye said. \"But if I would've voted, I would've voted for Trump.\"His surprising support for Trump was met with anger and confusion in the hip-hop community as activists and artists against the Trump administration amid fears that Trump could threaten civil rights of minority groups.","Updated 1940 GMT  February 6, 2017 ","job-152791-2-9","job-152791-2-9","job-152791-2-9",1486425649409.0,"cnnbasic","Kanye West deletes all tweets defending Trump meeting",-1032360586]