["TamingnewsItem","January 31 marks one of the busiest 24 hours in European football.The final day of the winter transfer window, it provides clubs with a last chance to buy players -- often for over the odds -- and strengthen their squads.While the English Premier League's TV riches regularly allow it to have the pick of the world's best players, it does now at least have one competitor that can match -- and exceed -- the prices it pays: The Chinese Super League.This season, Shanghai SIPG alone has spent more than $100 million signing Brazilian pair Oscar and Hulk -- and will spend many more millions on player wages.Shanghai Greenland Shenhua, meanwhile, made Carlos Tevez the highest earning footballer on the planet, paying him a reported weekly wage of $765,000 -- double what 2017 Ballon d'Or winner Cristiano Ronaldo earns.\"Up until about four weeks ago, there was huge expenditure on players -- not just transfer fees but their salaries as well,\" Professor Simon Chadwick -- a business of sport specialist at the University of Salford -- told CNN.\"In some ways Carlos Tevez was the tipping point because there were lots of stories that he was going to be paid somewhere in the region of $750,000 a week, effectively for a guy who is nearing retirement.\"Shortly after Tevez, the Chinese government intervened and effectively said, 'No more.' Now a lot of people believe that was the bubble bursting -- in other words that the Chinese football transfer market had overheated at that was the end. But that's actually incorrect.\"Chadwick believes the government is clamping down on outward currency flow in general, whether it be football, investing in overseas businesses or buying stocks and shares.\"So what we've seen over the last four weeks is simply the Chinese government exercising those same controls on football by saying don't spend as much money on oversea players, don't spend as much on transfer fees and salaries,\" he continued. \"And the Chinese don't actually want Chinese football teams populated by foreigners. What they want is Chinese football teams populated by Chinese players.\"So we will see the football transfer market gradually begin to cool and there will be fewer players coming from overseas.\"We'll start to see resources being diverted much more towards investment in Chinese football, particularly at grassroots level.\"The Chinese Super League's spending hasn't been just on international stars.Earlier this month, Hebei China Fortune -- coached by former Manchester City manager Manuel Pellegrini -- made Zhang Chengdong the most expensive Chinese footballer in history after paying Beijing Guoan $21.6 million for his services.Concerned that clubs are not investing enough in homegrown talent, new government rules mean each team can only field three foreign players in a match and must have a Chinese player under the age of 23 on the pitch at all times -- while a ban on foreign goalkeepers has been in place since 2001.The league's 16 clubs must also set aside 15% of expenditure for their youth teams and will be penalized by the Chinese Football Association if they overspend on transfers and player wages.However, there are now concerns the limit on foreign players could drastically drive up the prices of Chinese players, with teams regularly paying fees in the region of the Chengdong deal. Chadwick agrees.\"Last week, Beijing Guoan literally overnight became one of the most valuable football clubs in the world. What China seems to be particularly adept at doing is artificially creating values for clubs and players.\"According to , since 2008, the average market value of CSL clubs has increased almost 2,000% -- from $183,000 to $3.54 million.\"For a Chinese football club to break the world record for a foreign player, so Cristiano Ronaldo for example, is a very, very powerful statement in terms of the position of Chinese football in the world community.\"But, ultimately, China wants a Chinese footballer as the most expensive footballer in the world and I think we're heading very, very rapidly towards that point. \"Not in the next week or next month, but certainly in the coming years. One of the things China doesn't have right now is a global icon. \"Portuguese football does or German football does and I think when we begin heading towards the point where this Chinese icon emerges, then it's conceivable that a Chinese player will replace Paul Pogba as the most expensive player in the world.\"China's president Xi Jinping has made no secret of his desire for the country to become a global football superpower.The increased spending by clubs on proven European or South American stars should, in theory, increase the quality of China's domestic league and benefit the country's leading players, although the national team is yet to feel a knock-on effect.China is a lowly 81st in the FIFA rankings and recently , but Jinping maintains the desire to qualify for, host and -- one day -- win a World Cup.\"In November 2014, Xi announced that he wants China to have created the world's biggest domestic sport economy by 2025,\" Chadwick said. \"So he's looking at China to have created a domestic sport economy worth $850 billion by 2025. \"He wants football to drive that move towards this big sport industry. So the target has now been set: By 2050 China wants to be a world leading FIFA nation and to have won the men's World Cup.\"Meanwhile in the European transfer market, Julien Draxler, Gabriel Jesus, Goncalo Guedes and Dimitri Payet are players that moved for $30 million or more, with the next most expensive -- Morgan Schneiderlin -- joining Everton for $24 million.\"As China has become a major player in the transfer market, the market has started to overheat and agents in particular have used that as a means of increasing transfer prices and wages,\" Chadwick said. \"And the European clubs' response to that has been to basically take a step back from it and not be affected by those inflationary pressures that China has brought.\"One deadline day signing that didn't attract huge headlines was Australian Trent Sainsbury's move to Inter Milan from Jiangsu Suning.While not a marquee name, Chadwick believes Sainsbury's transfer could potentially be the start of a larger plan being put into place by Chinese football. \"A lot of the investors  sense bigger business opportunities,\" Chadwick explained. \"What's interesting about Suning is they're the owners of the selling club, they're the owners of the buying club,\" added Chadwick, referring to Chinese retail giant Suning Holdings buying a majority stake in Inter Milan in June 2016.\"There were also rumors last year that they were interested in acquiring The Stellar Group, which represents Gareth Bale.\"So conceivably we're heading towards a scenario where the same Chinese corporation could own the buying club, the selling club and the intermediary and I think, in essence, the Chinese are trying to exercise power and control over football supply chains. \"If you're controlling the buying and the selling clubs and the intermediary, then you control the supply chain.\"","Updated 1044 GMT  February 1, 2017 ","job-152791-2-9","job-152791-2-9","job-152791-2-9",1486427031095.0,"cnnbasic","Deadline day: Chinese Super League flexes financial muscle during January transfer window",-1033510065]