["TamingnewsItem","The loans, which come from a Canadian aerospace and defence\nfund targeting research and development projects, will be used\nfor Bombardier's CSeries family of narrowbodies and the Global\n7000 business jet, according to a statement from the government.The contributions will be provided over four years, in a\nnumber of installments, with the majority allocated to the\nGlobal 7000 program.\"The repayable contributions announced today will help to\nensure that Canada remains at the centre of Bombardier's\nresearch and development activities,\" Bombardier Chief Executive\nAlain Bellemare said in a statement.Bombardier initially asked Canada to match a $1 billion\ninjection in the CSeries program from the province of Quebec in\n2016. But negotiations dragged on for more than a year as the\nLiberals made requests of the company, such as changes to its\ndual class governing structure.Prime Minister Justin Trudeau's government is under pressure\nto invest in Montreal, Quebec-headquartered Bombardier, after\nhis ruling Liberals unexpectedly won 40 of the province's 78\nParliamentary seats, far more than expected, in an October 2015\nelection.Bombardier, which briefly considered bankruptcy protection\nlast year after simultaneous airplane developments caused a cash\ncrunch, is now in a better position financially than when it\nasked for the matching $1 billion.Quebec's spending in the CSeries, along with a separate $1.5\nbillion investment by the province's largest pension fund in\nBombardier's rail division, could trigger a new trade feud\nbetween the company and rival Brazilian planemaker Embraer SA\n.Brazil's foreign ministry in December authorized World Trade\nOrganization proceedings against Canada over Bombardier's\nroughly $5.4 billion CSeries jetliner program, which competes\nwith some Embraer jets as well as the smallest products of plane\ngiants Boeing Co and Airbus Group SE.Reimbursable loans are a key pillar of the world's largest\ntrade dispute, involving mutual transatlantic claims of unfair\nsupport for aircraft makers Airbus and Boeing.The WTO found that government loans used by European Union\nmember states to support Airbus airplane developments\nconstituted unfair subsidies, prompting the threat of U.S.\nsanctions. But, after more than a decade, the case has yet to\ncomplete lengthy WTO legal and compliance processes.\n \n\n (Reporting By Allison Lampert in Montreal, Additional reporting\nby Tim Hepher in Paris and Sweta Singh in Bangalore; Editing by\nSavio D'Souza)","Tue Feb 7, 2017 | 6:30pm EST","job-152791-1-13","job-152791-1-13","job-152791-1-13",1486512846376.0,"reutersbasic","Canada announces C$372.5 mln loan to Bombardier",-1038016518]