["TamingnewsItem","Democrats raised concerns Friday and Saturday about recent immigration enforcement actions -- though immigration officials say that only routine actions targeting criminals were underway. Fear is running high among immigrant communities since President Donald Trump's inauguration -- and after the recent publicized deportation of an of two after a routine visit with immigration officials, reports have been spreading of Immigration and Customs Enforcement stepping up its actions in the southwestern US.The actions are the first concerted effort by ICE under the Trump administration to arrest targeted undocumented immigrants for deportation proceedings. It's unclear at this point in the nascent administration whether it was a sign of things to come, or whether the actions were conducted under any different procedures than could have been in place under the Obama administration. It was the uncertainty, the publicity of the raids and the high tensions raised by public comments on immigration by Trump administration officials that had Democrats asking for more information. \"These reports show the serious consequences of the president's executive order, which allows all undocumented immigrants to be categorized as criminals and requires increased enforcement in communities, rather than prioritizing dangerous criminals,\" California Sen. Dianne Feinstein said in a statement responding to media reports of the stepped up enforcement, including some accounts that the actions were targeting low-priority undocumented immigrants, including family men and women.ICE in Los Angeles said Friday it had conducted a five-day operation targeting criminals and fugitives, and said that the vast majority of those arrested had criminal histories. Seeking to push back on reports of indiscriminate raids, ICE released the results of the operation from its Los Angeles office, saying about 160 foreign nationals were arrested during the week. Of those, 150 had criminal histories, and of the remaining arrests, five had final orders of removal or were previously deported. Ninety-five percent were male, they said. While specific numbers weren't available, ICE said \"many\" of the arrested individuals had prior felony convictions including violent charges like child sex crimes, weapons or assault charges. An ICE official confirmed Atlanta had conducted a similar surge this week, and roughly 200 arrests were made in Georgia, North Carolina and South Carolina in a similar routine enforcement action. Texas Democratic Rep. Joaquin Castro said in a statement that he had confirmed with ICE's San Antonio field office that similar actions were conducted across Texas, calling the action \"Operation Cross Check.\" He said he would be following up to make sure the actions were targeting the worst offenders. Full numbers for the actions across the country will be made available Monday, the agency said. A Department of Homeland Security spokeswoman said overall about the agency's actions that everything is \"routine,\" and are not part of casting a widespread net.\"ICE Fugitive Operations teams are out every day as part of routine, targeted enforcement operations,\" said acting press secretary Gillian Christensen. \"These are existing, established fugitive operations teams. ICE does not conduct sweeps or raids that target aliens indiscriminately. ICE only conducts targeted enforcement of criminal aliens and other individuals who are in violation of our nation's immigration laws.\"Still, as Trump continues to talk about cracking down on illegal immigration, advocates remain concerned that the new administration could be stepping up enforcement against otherwise peaceful undocumented immigrants.On Thursday, protests sprang up at the deportation of Guadalupe Garcia de Rayos, a 35-year-old mother of two, who had checked in with ICE at an office in Phoenix the day before, as she had regularly since a 2008 conviction of using a fake Social Security number. Friday, Democrats decried the actions nationwide as needlessly causing fear for immigrant communities. \"The President wants to show off and it appears he has unleashed the Department of Homeland Security to kick-out large numbers of immigrants and anyone they encounter, without much oversight, review or due process,\" said Illinois Democratic Rep. Luis Gutierrez. \"The goal of such policies is to inject fear into immigrant communities, frighten families and children, and drive immigrants farther underground. It damages public safety and the fabric of American communities while putting a burden on local social services and the foster-care system.\"Gutierrez's concerns were echoed by Rep. Lucille Roybal-Allard, a Democrat from California.  \"I am outraged to hear of the recent ICE arrests in southern California. If the Trump administration is genuinely concerned about threats to American security, it should prioritize violent felons and others who pose real danger,\" Roybal-Allard said in a statement. \"My office has been working to get detailed information from ICE.\"Fellow California Rep. Lou Correa  he was \"deeply concerned\" about the actions as well, and after ICE announced the arrests, he sent a letter demanding more answers.\"These activities have caused fear and uncertainty for many of constituents,\" Correa wrote, and listed 10 questions he wanted answers for from ICE, among \"How far in advance were these enforcement activities planned?\"  And a city councilman from Austin, Texas, said he was concerned that ICE was making a public show of force in his city as retribution for being a sanctuary city.\"ICE actions like these are beyond reprehensible,\" Greg Casar said in a statement. \"They instill fear in the community, and they make everyday people fear for their lives.\"While ICE characterized the actions as routine, fear remains that the Trump administration's recent executive order beefing up interior enforcement of immigration laws could mean a vast expansion of deportations of undocumented immigrants.While the Obama administration had clear guidance prioritizing deportation of high-level criminals, an executive order signed by Trump in his first week set up enforcement priorities that could include virtually any undocumented immigrant living in the US.Trump made cracking down on illegal immigration a central focus of his presidential campaign. On Saturday, the President defend another part of his campaign promise on immigration, vowing to keep costs down on a border wall that would span the US southern border with Mexico. \"I am reading that the great border WALL will cost more than the government originally thought, but I have not gotten involved in the ... design or negotiations yet. When I do, just like with the F-35 FighterJet or the Air Force One Program, price will come WAY DOWN!\" Trump wrote in two consecutive tweets. ","Updated 10:07 AM ET, Sat February 11, 2017 ","http:\/\/rss.cnn.com\/rss\/edition.rss","http:\/\/www.cnn.com\/2017\/02\/10\/politics\/democrats-question-ice-enforcement-raids\/index.html","job-152791-2-24",1486833200452.0,"cnnbasic","Democrats, advocates question ICE enforcement raids after hundreds of arrests",-1038304069]