["TamingnewsItem","The verdict in a gang-rape case of two teenage girls in Puntland, Somalia has sent ripples through the semi-autonomous East African state.Five boys were arrested after footage of the event was posted on social media in December and the case was highlighted by the Galkayo Education Center for Peace and Development and its international partner, Donor Direct Action.The families of the two survivors had previously rejected . Activists and government authorities had hoped that the case would be arbitrated under the , passed in Puntland in late 2016, but in the end, a combination of customary, secular and Sharia law was applied.In a landmark decision, the court of five religious leaders, with Puntland government authorities as observers, ruled on Sunday that the rapists should serve between five and ten years in prison and pay fines of several thousand dollars each.The case was brought to trial relatively quickly. It is less than two months when, on the evening of December 6th, Authorities say a group of boys jumped out of a car and forced them inside. They drove for around 15 kilometers, stripped the girls naked and raped them in turn. One boy filmed and took pictures -- which would also later be used as evidence in the trial. When the older girl tried to resist, one of the boys stabbed her in the back. At around 3 am the following morning the girls were abandoned, still naked, near the younger girl's home. They managed to find some clothes and escaped to extended family nearby.A few days later, social workers from the Galkayo Center made contact with the girls and took on the case. They provided counselling and financial support to the severely traumatised girls and referred the 16 year old, who had suffered the knife wound, for medical treatment. The incident was reported to police. During this time, it also emerged that this was the second occasion that one of the girls had been raped in ten days. The torturous journey that these two girls have had over the last two months has reached some form of resolution, but the Galkayo Center deals with cases of rape and helps to protect girls from other forms of violence such as female genital mutilation  all the time.As is the case in most countries around the world, the fact that shame tends to be bestowed on the victim rather than perpetrator of the crime means that this extreme form of violence against women and girls is cloaked in silence. The rapist is protected by the fact that speaking out is close to impossible -- and when it does happen, a huge price is usually paid by the survivor and her family. They are often stigmatized by coming forward, while the rapist is often gain full impunity -- or some form of agreed settlement without having to pay a significant price for their actions.It is difficult to estimate the extent of rape in the semi-autonomous region of Puntland -- or in the nation of Somalia in general, but reports indicate that it is a . Unfortunately, when peace and security decreases in any country, violence against women and girls tends to increase.Incredibly, there have also been instances too of jail  to alleged victims, as well as to journalists who cover such cases. Other evidence has been gathered of insensitive treatment by the authorities of women reporting instances of rape -- including one example of  after going against the grain by making a formal report.With the passing of the new Act and a seemingly stronger will to deal with these cases quickly and effectively, the Puntland administration appears to be at least indicating that it wants to take sexual violence seriously at last. We are somewhat hopeful that things may finally be starting to change for the better. The only positive thing arising from this horrific case is that the silence may be about to break, but changing attitudes and ensuring that survivors of rape are protected throughout -- while holding rapists accountable -- is likely to take some time yet.","Updated 1303 GMT  February 6, 2017 ","job-152791-2-9","job-152791-2-9","job-152791-2-9",1486427689462.0,"cnnbasic","Will landmark gang-rape case spur change in attitudes in Puntland?",-1036001962]