["TamingnewsItem"," Space Exploration Technologies Corp, better known as SpaceX, plans to launch its Falcon 9 rockets every two to three weeks, its fastest rate since starting launches in 2010, once a new launch pad is put into service in Florida next week, the company's president told Reuters on Monday.The ambitious plan comes only five months after a SpaceX rocket burst into flames on the launch pad at the company's original launch site in Florida. SpaceX, controlled by billionaire Elon Musk, has only launched one rocket since then, in mid-January. “We should be launching every two to three weeks,” SpaceX President Gwynne Shotwell told Reuters in an interview on Monday.SpaceX was approaching that pace last autumn, before the Sept. 1 accident, which happened during a routine preflight test. The explosion destroyed a $200 million Israeli satellite and heavily damaged the launch pad.Shotwell said repairs to the launch pad at Cape Canaveral Air Force Station, which are still underway, should cost “far less than half” of a new launch pad, which she said runs about $100 million. The new launch pad is at NASA's Kennedy Space Center, just north of the Cape Canaveral site. SpaceX is also modifying the rocket's engines to increase performance and resolve potential safety concerns, said Shotwell.The company plans to change the design of the Falcon 9's turbopump - which provides propellants to the rocket's engines - to eliminate cracks that have prompted concern from NASA and the U.S. Air Force.NASA has hired SpaceX to taxi astronauts to and from the International Space Station starting in late 2018. Shotwell said the new turbopumps will be installed before the first unmanned test flights of the commercial space taxi, scheduled for November. SpaceX is one of two companies certified to fly military and national security satellites for the Air Force, the other being United Launch Alliance, a partnership of Boeing Co  and Lockheed Martin Corp .“For us, the concern was not the cracks, but do they grow over time? Would these cracks cause a flight failure?” Shotwell said. “I think NASA is used to engines that aren’t quite as robust, so they just don’t want any cracks at all in the turbo machinery.\"SpaceX discovered two types of cracks during ground tests of its Merlin engines in 2015, Shotwell said. The cracks were not related to the Sept. 1 launch pad explosion. To fix the more serious cracking issue, the company devised a software fix and then redesigned the turbine wheel, Shotwell said. The first of the redesigned turbine wheels flew in July 2016.A second set of cracks in welds and shrouds are not a concern for flight, but NASA and the Air Force have asked for a redesign, Shotwell said.SpaceX has a backlog of more than 70 missions, worth more than $10 billion. It has successfully flown 27 out of 29 times since the Falcon 9’s debut in 2010. The company flew eight missions in 2016 before the launch pad accident in September grounded the fleet. The rocket returned to flight last month, flying from a second launch site in California, which is only used for satellites heading into polar or high inclination orbits. A fourth launch site in Texas is under construction.  ","Mon Feb 6, 2017 | 8:26pm EST","job-152791-1-15","job-152791-1-15","job-152791-1-15",1486569772401.0,"reutersbasic","Exclusive: SpaceX to hit fastest launch pace with new Florida site - executive",-1042595015]