["TamingnewsItem","A little over one week after  to the United States, a family of Syrian Orthodox Christians were reunited with their American relatives Monday morning at John F. Kennedy airport in New York City. The Asalis, who belong to one of the most persecuted groups in war-torn Syria, have been trying to join their stateside relatives for almost 15 years. Sarmad Assali, a US citizen who lives in Allentown, Pennsylvania, had been waiting to welcome her two brothers-in-law, their wives and children. The six Syrians were due to arrive in Philadelphia on Jan. 28, one day after President Donald Trump signed an executive order barring immigrants from seven majority-Muslim countries from entering the country. Before their arrival, Assali, who spells her surname differently than the Syrian members of the family, had purchased and furnished a house for her relatives \"to help them start a new life.\"But when the Asalis finally landed in Philadelphia after flying in by way of Beirut and Qatar, they were told they had to get on the next flight back to Doha, or be detained and potentially lose their visas.Facing a language barrier and unable to contact their American relatives, they chose to get back on the plane. After Sarmad Assali filed a lawsuit with the ACLU on their behalf and a federal judge's decision temporarily lifted the travel ban, the family was able to legally enter the US.\"They're in disbelief that they're here,\" Assali told CNN. \"Even though the whole way they had a feeling something was going to happen, now they are finally here and just in awe.\"Assali drove her relatives back to their home in Allentown. When they were denied entry and sent back to Qatar a week ago, she was unsure if they'd be able to use the home that she'd prepared for them. So it was with joy that they sat down to lunch together on Monday. Pennsylvania Governor Tom Wolf joined the family for lunch, tweeting that he was \"happy to have you reunited in PA after your ordeal.\" In the nine days that the family was in limbo back in the Middle East, Sarmad Assali, an army of lawyers, politicians and protesters expressed their support and worked to help the family enter the United States.Assali, along with the American Civil Liberties Union, refugee aid group HIAS Pennsylvania and the Philadelphia chapter of the American Immigration Lawyers Association, filed a lawsuit asking the court to order that the government authorize the family's entry and pay for their travel back to the United States. Rep. Charlie Dent, R-Pennsylvania, who represents Allentown, found out about the family's story and got involved as well.After the Washington state federal judge's decision was handed down late Friday night, Assali and those helping her started working to get the family back to the United States the next day. Their original visas were reissued, and they entered the country as legal permanent residents, ACLU Pennsylvania Communications Director Andy Hoover said.Dent met the family at the airport upon arrival. He had worked closely with Assali and the ACLU to make sure the Asalis could enter the country, according to Hoover.The family members were able to get last minute tickets from Beirut. Sarmad Assali told CNN that \"everything was resolved, and all of their paperwork was proper.\" The Asalis began their immigration process in 2003. They were approved to enter the United States on an F-4 visa for brothers and sisters of US citizens in late 2015. They finalized their paperwork, interviews and medical examinations in late December last year. After years of preparation and waiting, Assali said, the family is excited to be together again. \"We're happy to have them,\" she said.CNN's Sarah Jorgensen and Laura Ly contributed to this report.","Updated 9:15 PM ET, Mon February 6, 2017 ","job-152791-2-11","job-152791-2-11","job-152791-2-11",1486459525879.0,"cnnbasic","Emotional reunion for Syrian Christian family caught in Trump's travel ban",-1043443029]