["TamingnewsItem","President Donald Trump vowed stout support for NATO on Monday, even as he insisted again that member countries scale up their defense spending on the alliance.Trump has offered varying stances on NATO during his campaign and presidency, calling the membership obsolete and ill-prepared to confront modern-day threats. His remarks Monday signaled he would maintain US backing for the partnership while continuing to press other countries to meet its budget requirements.\"We strongly support NATO,\" Trump said at the headquarters of US Central Command in Florida. \"We only ask that all of the NATO members make their full and proper financial contributions to the NATO alliance, which many of them have not been doing. Many of them have not been even close. And they have to do that.\"NATO expects its members to commit to spending 2% of their gross domestic products on defense. Only five of the 28 countries that belong to NATO have met that goal.Trump has long criticized the shortfalls, suggesting the US was subsidizing other nations' security at the expense of its own. But since taking office, he's avoided the harsh rhetoric he used on the campaign trail questioning the alliance's relevance.On Sunday, Trump spoke by phone to NATO's Secretary General Jens Stoltenberg from his Florida estate. In the conversation, the White House said the President discussed the United States' \"strong support\" for the group, while also covering \"how to encourage all NATO allies to meet their defense spending commitments.\"to be held in Europe in May.Trump's defense secretary, James Mattis, has spoken favorably of NATO as well. In his remarks at MacDill Air Force Base on Monday, Trump painted a dark picture of global security, warning against terrorist attacks and committing to provide ample resources to American forces.\"We're going to be loading it up with beautiful new planes, and beautiful new equipment,\" Trump said of the military installation, which also houses the US Special Operations Command. \"You've been lacking a little equipment. We're going to load it up. You're going to get a lot of equipment. Believe me.\"\"Radical Islamic terrorists are determined to strike our homeland as they did on 9\/11, as they did from Boston to Orlando to San Bernardino and all across Europe,\" Trump told enlisted servicemen and women on the base.He also suggested that the media was downplaying terror threats.\"All over Europe, it's happening. It's gotten to a point where it's not even being reported. And in many cases, the very, very dishonest press doesn't want to report it. They have their reasons, and you understand that,\" Trump said, without explaining his allegation.The White House insisted Monday that Trump's comments about the media failing to cover terror threats were \"very clear.\"Certain terror events \"aren't exactly covered to a degree on which they should be,\" Press Secretary Sean Spicer told reporters aboard Air Force One, without giving any specific instances.A White House official later released a list of 78 \"major terrorist attacks,\" either executed by ISIS or ISIS-inspired, most of which it claims \"did not receive adequate attention from Western media sources.\"Those attacks took place from September 2014 to December 2016. CNN's Dan Merica contributed to this report","Updated 0607 GMT  February 7, 2017 ","job-152791-2-11","job-152791-2-11","job-152791-2-11",1486459676537.0,"cnnbasic","Trump salutes NATO with vow of strong support",-1051098897]