["TamingnewsItem"," The European Union's top migration official will tell the new U.S. Homeland Security Secretary John Kelly in Washington on Wednesday that the United States cannot shut its doors on refugees despite President Donald Trump's orders.The EU's migration commissioner, Dimitris Avramopoulos, will be the first senior Brussels official to visit Washington since Trump's inauguration more than two weeks ago. Much of this time has been dominated by uproar over Trump's decision to stop allowing refugees into the United States and barring almost any travel from seven Muslim-majority countries, a move he said was needed to ensure his nation's safety.The EU is also trying to curb immigration after some 1.6 million people arrived in the bloc in 2014-2016, an uncontrolled influx that caught it unprepared, triggered bitter political disputes between member states and raised security concerns. The bloc has resorted to tightening its borders, rejecting labor migrants more stringently and tightening asylum rules for refugees. These measures, however, do not go anywhere near Trump's ban on refugees, which the EU has criticized.\"Refugee resettlement is a global responsibility and it cannot be shouldered by just a handful of countries,\" Avramopoulos told Reuters on the eve of his talks with Kelly.\"Nations with a long experience in this field, having hosted millions of migrants and refugees, I hope will continue playing their responsible leading role,\" he said in emailed comments.Should the United States rescind more permanently the international law obligation to help people fleeing war or persecution, it would leave the EU under even more pressure.Separately on Tuesday, a European court cast doubt on the bloc's strategy to deal with the migration crisis, by saying EU countries cannot refuse entry to people at risk of torture or inhuman treatment. Avramopoulos and Kelly will also discuss security during their first face-to-face meeting that comes at a delicate time for the transatlantic relationship, with the EU worrying Trump could turn his back on America's European allies.\"Democracy, equality, the rule of law – these are all values we share with the US. Of course our openness should not come at the expense of our security – but our security objectives should never come at the expense of our fundamental values of openness and tolerance either,\" Avramopoulos said. ","Tue Feb 7, 2017 | 7:05am EST","job-152791-1-12","job-152791-1-12","job-152791-1-12",1486483370318.0,"reutersbasic","U.S. must go on taking refugees, EU migration chief to say in Washington",-1057008314]