["TamingnewsItem"," An overpass under construction in the bustling Indian city of Kolkata collapsed on Thursday on to vehicles and street vendors below, killing at least 14 people with more than 100 people feared trapped.Residents used their bare hands to try to rescue people pinned under a 100-metre  length of metal and cement that snapped off at one end and came crashing down in a teeming commercial district near Girish Park.\"The concrete had been laid last night at this part of the bridge,\" resident Ramesh Kejriwal told Reuters.\"I am lucky as I was planning to go downstairs to have juice. When I was thinking about it, I saw that the bridge had collapsed.\"Video footage aired on TV channels showed a street scene with two auto rickshaws and a crowd of people suddenly obliterated by a mass of falling concrete that narrowly missed cars crawling in a traffic jam.Chief Minister Mamata Banerjee, whose center-left party is seeking re-election in the state of West Bengal next month, rushed to the scene.\"We will take every action to save lives of those trapped beneath the collapsed flyover. Rescue is our top priority,\" she said.Banerjee, 61, said those responsible for the disaster would not be spared. Yet she herself faces questions about a construction project that has been plagued by delays and safety fears.A newspaper reported last November that Banerjee wanted the overpass - already five years overdue - to be completed by February. Project engineers expressed concerns over whether this would be possible, The Telegraph said at the time.The disaster could play a role in the West Bengal election, one of five being held next month that will give an interim verdict on Prime Minister Narendra Modi's nearly two years in power.Indian company IVRCL  was building the 2-km  Vivekananda Road overpass, according to its web site. Its shares closed down 5 percent after falling by up to 11.8 percent on news of the disaster.IVRCL's director of operations, A.G.K. Murthy, said the company was not sure of the cause of the disaster.\"We did not use any inferior quality material and we will cooperate with the investigators,\" Murthy told reporters in Hyderabad where the firm is based. \"We are in a state of shock.\"NO ACCESSA coordinated rescue operation was slow to get under way, with access for heavy lifting gear and ambulances restricted by the buildings on either side of the flyover and heavy traffic.Police said that 78 injured had been taken to Kolkata's Medical College Hospital after the disaster struck at around noon.\"Most were bleeding profusely. The problem is that nobody is able to drive an ambulance to the spot,\" said Akhilesh Chaturvedi, a senior police officer.Eyewitness Ravindra Kumar Gupta, a grocer, said two buses carrying more than 100 passengers were trapped. Eight taxis and six auto rickshaws were partly visible in the wreckage.\"Every night, hundreds of laborers would build the flyover and they would cook and sleep near the site by day,\" said Gupta, who together with friends pulled out six bodies.\"The government wanted to complete the flyover before the elections and the laborers were working on a tight deadline ... Maybe the hasty construction led to the collapse.\" ","Thu Mar 31, 2016 | 3:58pm EDT","job-152791-1-9","job-152791-1-9","job-152791-1-9",1486423090854.0,"reutersbasic","India overpass collapse kills 14; scores feared trapped",-1069268649]