["TamingnewsItem","New York and Boston will close their public schools Thursday, and airlines have scrubbed thousands of flights as the Northeast braces for a major storm that could dump more than a foot of snow in some areas.New York Mayor Bill de Blasio tweeted Wednesday night that his city would close its schools. In New York and Philadelphia, the storm will hit around daybreak, with 30-mph winds creating whiteout conditions at times, CNN meteorologist Dave Hennen said.Six inches to a foot will collect in New York, with 5 to 10 inches in the City of Brotherly Love.Boston Mayor Martin Walsh said that the city's public school system would be shut Thursday, and he urged people to be \"looking out for your elderly neighbors, disabled neighbors, neighbors who might not be able to help themselves.\"Connecticut Gov. Dannel Malloy said state colleges and courts would be closed. \"This is a serious challenge when you talk about 8-14 inches\" of snow, he said. On Wednesday night, Flightaware.com reported that airlines had canceled over 2,200 flights into and out of the United States on Thursday in preparation for the storm.Winter storm warnings are in effect for Boston and New York. Boston should get about a foot of snow, with Springfield and Fitchburg, also in Massachusetts, seeing a few inches less.The good news is that the storm is expected to move out quickly. However, snow might fall in Boston on following days, and temperatures won't rise above freezing there until Sunday, .The storm won't cause hardship much below Washington. It will get less than half an inch of snow Thursday morning, .The storm is expected to pack a punch, but it's not a nor'easter.Nor'easters get their name from the winds that blow from the northeast ahead of a storm's arrival as it moves up the Eastern Seaboard, remaining offshore.This storm will move from west to east, from land out to sea, so it can't be classified as a nor'easter.The region did have a nor'easter on January 24. That storm jammed roads and caused major disruptions in air travel.New Yorkers will experience a bit of \"weather whiplash.\"Temperatures on Wednesday set a new record high of 65 at JFK International Airport, nearly 30 degrees above average for early February. The mild conditions will be extremely short-lived as temperatures plummet overnight and pave the way for snow.Wednesday morning was cold in Boston, and icy road conditions in the Wakefield area north of the city caused numerous wrecks,  reported. State officials said Route 128 northbound north of Interstate 93 was closed because of multivehicle wrecks, WFXT said.The Northeast is not the only part of the country having severe weather.On Tuesday, nine tornadoes were reported in the Southeast, mostly in Louisiana.One that touched down east of downtown New Orleans was rated at least an EF2, considered a significant tornado with winds between 111 and 135 mph,  reported.WDSU said the storm injured about 25 people and damaged 60 structures. Some residents won't have power restored until the weekend, the TV station said, citing local power companies.Late last month, tornadoes  and killed at least 20 people.","Updated 7:18 PM ET, Wed February 8, 2017 ","http:\/\/rss.cnn.com\/rss\/edition_us.rss","http:\/\/www.cnn.com\/2017\/02\/08\/us\/snowstorm-northeast-weather\/index.html","job-152791-2-16",1486601418853.0,"cnnbasic","New York, Boston close schools ahead of snowstorm ",-1066167826]