["TamingnewsItem","At Sunday's Grammys, a man and a transgender woman will join the so-called trophy girls who bring music's top honors onstage.It's a change that puts the Grammys in the front ranks of awards diversity.\"To be honest, the idea of a 'trophy girl' has felt antiquated for some time now,\" Neil Portnow, president of the Recording Academy, said in a statement Friday. \"Who wrote that rule anyway? The ability to present a trophy has nothing to do with one's gender.\"The change wasn't made to be provocative or buck convention, he added, but to acknowledge that \"music's universal power lies in its spirit of inclusion\" for all people and their voices.In recent years, the Academy Awards has replaced its female trophy presenters with male and female film students, both American and from countries including China and Zimbabwe. That mix stood in contrast to the largely white slate of nominees, finally relieved this year by several nods for African-American artists including Denzel Washington .Changing up the Grammy trophy presenters isn't window-dressing. The awards increasingly have honored a variety of artists in different genres, from rap to country to jazz to classical, with Beyonce and Adele among the top contenders this time around.The three trophy handlers at Sunday's ceremony are transgender model Martina Robledo; model and actor Derek Marrocco, and model and actress Hollin Haley. The ceremony airs live on CBS from 8-11 p.m. EST with James Corden as host.Robledo, who's from San Diego, said she was honored to join Caitlyn Jenner, Laverne Cox and other transgender people in the more-inclusive media spotlight. But she expects viewer reaction to her presence will be mixed.\"I know it's going to make some people uncomfortable and make others weep for joy,\" she said. \"I'm just going to step out there and strut and make sure I deliver my best, because there's people out there looking up to me.\"That may include transgender boys and girls or other minorities, she said, calling them \"the people I want to speak for ... to let them know that there is a better world out there for us.\"Marrocco, who's modeled for top designers including Valentino and Ralph Lauren, called his selection an honor that makes a point.\"No matter what your gender is, if you're qualified, you're qualified,\" he said.He may be scoring another first among presenters: Marrocco played football and basketball in college, for Susquehanna University in Pennsylvania, before transferring to Fairleigh Dickinson University in his native New Jersey to earn his bachelor's degree.Haley, a Texas native who moved to New York and then Los Angeles to pursue her career, said in a statement that being a presenter is a \"dream come true.\" She arrived in LA just weeks before she was selected for the Grammy job.","Published\n\t\t            February 11, 2017","http:\/\/feeds.foxnews.com\/foxnews\/entertainment","http:\/\/www.foxnews.com\/entertainment\/2017\/02\/11\/grammys-add-1st-man-transgender-woman-as-trophy-presenters.html","job-152791-3-21",1486861603589.0,"foxbasic","Fox NewsGrammys add 1st man, transgender woman as trophy presenters Entertainment",-1067595520]