["TamingnewsItem"," Surveys regularly find that Americans have no idea what a 529 college savings plan is, so a little tinkering under the hood is definitely needed. For more than 20 years, families have been able to save in these dedicated investment accounts, with the funds accumulating tax free, as long as the money is used for higher education. Changing the system even in the smallest way requires Congressional legislation, a tough sell in any given year, and even tougher in the current political climate. \"There aren't enough hours in the day,\" said Republican Representative Lynn Jenkins of Kansas, who just co-sponsored a bill with Democrat Ron Kind of Wisconsin to improve 529 and ABLE accounts, which are similar educational savings plans for disabled individuals.Jenkins has introduced legislation over the years to tweak educational savings plans. She had success with provisions that took effect in 2015 to make computers a qualified expense and change redeposit rules if a student withdraws mid-year. But there is more on her wish list, which she has been gathering since she was a state treasurer in charge of running the Kansas 529 plan. Others in the college savings industry also have thoughts on what could make such savings easier for families. Here are what insiders say needs the most attention: 1. Encourage employers to get in the gameOne of the key drivers of the new House bill, H.R. 529 , is to treat educational savings plans more like 401s and connect to families at the workplace, where they have become comfortable doing financial planning. \"There are more employers that offer pet insurance than college savings opportunities,\" said Marcos Cordero, chief executive at Gradvisor, a 529 benefit consultant. If companies are enticed through tax incentives to set up automatic payroll deductions and matching funds similar to retirement plans, it would be a great next step, said George Makras, director of institutional relationship management at Ascensus College Savings, an administrator of 529 plans.\"People are always telling me they wish they heard about 529s earlier,\" Makras said. \"Those dollars on the table will help encourage people to start earlier.\" 2. Free up the investmentsCurrent law limits families to two changes in their 529 investment options per year. While many 529 savers put their dollars into age-based funds that are calibrated behind the scenes over time, there are those who chafe at the portfolio restrictions. \"In the 401 space, you can rebalance as often as you want,\" said Rich Polimeni, chair of the College Savings Foundation, a not-for-profit advocacy group sponsored by the financial industry. 3. Allow greater access to the stashAnother reason families shy away from 529 plans is that they worry they will pay penalties on any extra money they save. Even though this is rare, and money can be easily shifted to other family members, it still is a mental obstacle to many. One way Jenkins' 2017 bill addresses that concern is by proposing to allow 529 monies to be used to pay off the student loans of a designated beneficiary. \"It sure beats the heck of some sort of  bail-out program,\" said Jenkins.While the goal of educational savings plans is to save ahead of time so you do not have to borrow, families often do both.For instance, a family may have needed to borrow for an older child to attend an expensive school, but they may have saved more by the time a younger child comes along, who ends up with a lower tuition bill. Under the proposed changes, the family could help pay off the older child's loans without incurring penalties and taxes on the growth of the account. \"The thing we're trying to encourage is to save for college rather than borrow. But people do need to borrow, so why penalize them for trying to save?\" said CSF's Polimeni.Another proposal in the pipeline: Allow families to roll over excess 529 money into Roth IRAs, since both have similar tax treatments.  Jenkins' office said this may make it into an upcoming bill. \"You're looking at a life spectrum from birth to the end,\" said Young Boozer, treasurer for the state of Alabama and chair of the College Saving Plan Network. \"It seems to make some sense to have a well-structured continuum.\"  ","Fri Feb 3, 2017 | 12:36pm EST","job-152791-1-9","job-152791-1-9","job-152791-1-9",1486422837556.0,"reutersbasic","Your Money: Three big ideas to make it easier to save for college",-1064898833]