["TamingnewsItem"," Barclays Plc  is about to overhaul its back office operations under a restructuring to help it comply with new post-crisis rules forcing British banks to ring-fence their retail operations from their riskier business. It has formed a new company that will operate as a standalone unit providing support services to both of its two main operations when they are formally separated - retail and investment banking, the bank said. The ring-fencing rules seek to avoid a repeat of the 2008 crisis, when banks' bad bets threatened depositors' cash. While Barclays was not among those that needed a UK taxpayer-funded bailout, the new rules apply to all lenders in Britain that have retail and commercial or investment banking activities. At Barclays, the aim is that critical support functions could continue to operate smoothly if either of its two main businesses were to run into trouble, while also keeping costs down by not having several separate back-office units, sources involved in the project said. The overhaul - including the creation of the new company known internally as ServCo - will affect most of the more than 10,000 people who work in Barclays back offices operations in 17 countries around the world.  It will group together the bank's huge operations in India and South Africa that provide technology support and data management, along with functions such as compliance with regulatory requirements, corporate relations, legal affairs and human resources.       While for some staff this will simply involve a change in the name of the legal entity they work for, the sources said it was also likely to lead to some job losses. Barclays declined to comment on the possible staff cuts or the cost of the restructuring. However, sources with direct knowledge of the project said it would soak up much of the 1 billion pounds  that Barclays has said it will cost to comply with the ring-fencing rules. UPHEAVAL The structural change shows the upheaval that British banks face to meet the rules that come into force in 2019. Other British lenders are working on similar models. HSBC transferred 18,000 employees to a UK-based service company in 2015, according to a company filing, as part of a move to insulate its back-office functions to comply with the new regulations. HSBC plans to base its ring-fenced British retail and commercial banking business in Birmingham, shifting about 1,000 staff to the central English city from London. Barclays, however, will keep both main operations headquartered at its building in the capital's Canary Wharf district.  Paul Compton, Barclays' chief operating officer, is overseeing the creation of the new company, which will formally be called Barclays Services Ltd. \"From the outset, we've been keen to use the incoming ringfencing regulations to enhance the banking experience for our customers and clients, and the establishment of the service company is a great example of how we can put this into practice,\" Compton told Reuters in an email. He declined to comment on how many people will work in the new unit. Some back office workers are confused about which entity they will end up working for and concerned about losing their jobs, two of the sources said. ServCo's management structure will be formalized by April with a view to it beginning operations by September, they added. Compton joined the bank in May 2016, one of many high-profile former JPMorgan  bankers recruited by Barclays Chief Executive Jes Staley, who himself ran the U.S. lender's investment banking division until 2013.   ","Sun Feb 5, 2017 | 6:15am EST",null,null,null,"scrapetime","source","Barclays to overhaul back office operations to cope with ring-fencing","reutersbasic",-1068166766]