["TamingnewsItem","It is a debate that has raged for years, but just who is golf's greatest of all time?Jack Nicklaus' mark of 18 major titles is the benchmark for brilliance, and seems more impregnable by the year.Tiger Woods once looked destined to surpass Nicklaus but he is marooned on 14 majors after years of battling injury and personal scandal.In fact, the question of any golfer eclipsing Nicklaus' milestone might now be redundant. \"I can't see any of the current crop coming near even Tiger, never mind coming near Jack,\" says Shane O'Donoghue, host of CNN's Living Golf show.      Woods'  set tongues wagging, but the once indomitable world No. 1 still needs five more majors to beat Nicklaus, who turns 77 in January. At this stage in his recovery, even a paltry PGA Tour win would represent a stunning achievement for Woods after 16 months out following multiple back surgeries.A first major since 2008 would be remarkable. But five? That is a Hall of Fame career in itself. And all past the age of 41?Sure, the case for Woods is strong. He held all four majors at once, he won some by huge margins, he spent a record 683 weeks as world No.1, he won more PGA Tour events than Nicklaus . But the \"Golden Bear\"  still eclipses Tiger, according to O'Donoghue.\"You can go to bat for Tiger Woods as much as you want, and I'm a massive fan and feel there's more in the tank,\" he says.\"But in terms of his career it is unlikely anyone will pass Jack Nicklaus. He deserves the accolade of greatest player of all time.\"It is not just the record number of major wins that sets Nicklaus apart.Of 56 top-five finishes, he also came runner-up a record 19 times. Woods, by comparison, has scored 31 top fives in majors with six runners-up spots. \"You just cannot overlook what Nicklaus achieved on a pretty limited schedule. He was a family man, he was quality over quantity,\" says O'Donoghue.\"We all know about the 18 majors but the 19 seconds and nine third places, that is just off the charts in terms of consistency in the majors. \"To be at that business end so often, like Jack Nicklaus was, is almost beyond comprehension. \"To have that level of success, desire and ability to bring the best out of yourself and prepare the best, it says a lot about his character and what he's like. He's still like that today. \"He's extremely disciplined and there's very little waste. He's about to turn 77 and his energy levels for business are very high.\" Nicklaus won his last three majors over the age of 40, and his final title, that glorious 1986 Masters, at 46. A newspaper article saying he was \"done, washed up, through\" provided the motivation, and a spell-binding final-day charge at Augusta gave Nicklaus a golden swansong to a 24-year span of major victories.  On that basis Woods, whose 14 majors came in 11 years beginning in 1997, has until 2021 -- or roughly another 20 major championships before a proper assessment can be made.  \"I've always thought that he's got at least another 10 years of good competitive golf in front of him, if he's healthy, and as talented as he is,\" Nicklaus told BBC Sport.Then again, fields are arguably deeper nowadays, although Nicklaus still had to contend with the likes of Arnold Palmer, Gary Player, Lee Trevino and Tom Watson. And there is more of a premium on youth and athletic ability. Ironically, the fitness revolution pioneered by Woods could be his downfall. Nicklaus, once derided as \"Fat Jack\" early in his career, remained injury free and made 146 consecutive starts in majors. Woods' longest streak was 46 .So if not Woods, then who else can challenge Nicklaus' supremacy? Of active players, Rory McIlroy and Jordan Spieth began their major hauls on a similar trajectory to Nicklaus and Woods and seem the most likely to take up the mantle.McIlroy became only the third player, after Nicklaus and Woods, to win three majors by the age of 25. He added a fourth, the 2014 US PGA, just a few weeks later. The Northern Irishman needs victory in the Masters to join the elite band of five players -- Gene Sarazen, Ben Hogan, Gary Player, Nicklaus and Woods -- to have won a career grand slam of all four major titles. But that's just the start -- Nicklaus and Woods each won three grand slams.\"I think Rory is an unbelievable talent,\" Nicklaus said in 2014. \"I love his swing, I love his rhythm, I love his moxie. He has an opportunity to win 15 or 20 majors or whatever he wants to do if he wants to keep playing. \"But you just don't know what the guy's priorities are going to be in life 10 years from now.\"For two years, though, he has been unable to add to his major haul.Spieth's stunning double major breakthrough at 21 in the Masters and US Open in 2015 drew many comparisons with Nicklaus and Woods, but his  this year dampened the hype.Meanwhile, world No.1 Jason Day clinched his sole major title the same year, but the 29-year-old, who sought  during his lay-off, may have flowered too late to mount a meaningful bid for the top.Phil Mickelson is closest of the current players to Woods with five majors. He is also a US Open victory away from a career grand slam.But the 46-year-old has age against him, and with six runners-up spots, the US Open has become his  In fact, the next real challenger to Woods or Nicklaus may not emerge for a generation, according to O'Donoghue. \"It is highly unlikely in the next 15 to 20 years,\" he says. \"You're going to see the emergence of newer nations in golf and you will see some Asian players who are going to be spectacular, but I just question anyone's desire to be at the top for a serious length of time now. The riches are too great.\"The era of Jack Nicklaus has well and truly gone. There will never be anyone like him, I don't think.\"","Updated 1325 GMT  December 21, 2016 ","job-152791-2-9","job-152791-2-9","job-152791-2-9",1486426806598.0,"cnnbasic","Jack Nicklaus: Is major haul untouchable, even for Tiger Woods? ",-1062045653]