["TamingnewsItem","The Trump administration is exploring ways to break Russia’s military and diplomatic alliance with Iran in a bid to both end the Syrian conflict and bolster the fight against Islamic State, said senior administration, European and Arab officials involved in the policy discussions.The emerging strategy seeks to reconcile President Donald Trump’s seemingly contradictory vows to improve relations with Russian President Vladimir Putin and to aggressively challenge the military presence of Iran—one of Moscow’s most critical allies—in the Middle East, these officials say.A senior administration official said the White House doesn’t have any illusions about Russia or see Mr. Putin as a “choir boy,” despite further conciliatory statements from Mr. Trump about the Russian leader over the weekend. But the official said that the administration doesn’t view Russia as the same existential threat that the Soviet Union posed to the U.S. during the Cold War and that Mr. Trump was committed to constraining Iran.Such a strategy doesn’t entirely explain the mixed signals Mr. Trump and his circle have sent regarding Moscow, which have unnerved U.S. allies and caught Republican leaders in Congress off guard.Mr. Trump himself spoke again about wanting to mend relations with Mr. Putin in an interview that aired before Sunday’s Super Bowl, saying “it’s better to get along with Russia than not.” After Fox News host Bill O’Reilly said Mr. Putin was a “killer,” the president responded: “What, you think our country’s so innocent?”But those involved in the latest policy discussions argue there is a specific focus on trying to drive a wedge between Russia and Iran.The Kremlin has said it aims to mend ties with the U.S. under the Trump administration but in recent months has also signaled its intent to continue to build on its cooperation with Iran.Moscow and Tehran have formed a tight military alliance in Syria in recent years. The Kremlin is a major supplier of weapons systems and nuclear equipment to Iran.","Published\n\t\t            February 06, 2017",null,null,"job-152791-3-3",1486392797562.0,"foxbasic","Fox NewsTrump administration looks to divide Russia's relations with Iran",-1069232525]