["TamingnewsItem"," MINNEAPOLIS -- The streak is as unlikely as any in the NBA. The Miami Heat were 11-30 after losing at Milwaukee on Jan. 13. They had lost four games in a row and 10 of their past 11. A return home and a three-day break was followed by a victory against the Houston Rockets, one of the top teams in the NBA. Another followed against Dallas and the victories built on each other. Miami  heads to Minnesota on Monday with a league-best, 10-game streak. The second-longest winning streak in the NBA this season is also the second-longest in league history by a team still under .500. \"Don't believe the hype,\" Heat coach Erik Spoelstra said after Saturday's 125-102 victory against the Philadelphia 76ers. \"We still have a lot of work to do. We still have to get to another level ... or two or three.\" Miami has its best streak since winning 10 in a row early in the 2013-14 season. The Timberwolves  believed themselves that their development was finally leading to results. Wins in five of six games had Minnesota confident. The young Wolves were growing with coach Tom Thibodeau and even gaining ground on a potential playoff spot in the Western Conference. What followed was Minnesota's own streak; three straight losses to teams with hold of playoff positions. The Wolves still had much to learn and then lost guard Zach LaVine for the rest of the season to an ACL injury. \"Yeah, it was a tough day,\" Thibodeau said of Saturday's 107-99 loss to the Memphis Grizzlies. \"But we still have to be ready to play. And we all felt the disappointment in it, but no one's going to feel sorry for us. So, we got to be ready to roll.  we're going to take a day to gather and then Miami's the hot team in the league right now and we've got to be ready.\" Minnesota was facing a short-handed Memphis without three starters, including All-Star center Marc Gasol. The Wolves had a big first quarter and led by as many as 18 before collapsing. \"We came out in the first quarter with a lot to prove,\" Minnesota's Karl-Anthony Towns said. \"I think with Zach on our minds, I don't know maybe we got worn down by all that emotion. We just didn't execute. We got too comfortable with the lead. We felt like we were just cruising to the victory line and we stumbled along the way.\" The Wolves have gotten too comfortable with leads too often this season, letting several big leads slip away to losses. But Minnesota has also proven to be able to end big streaks, as well. Houston -- tied with Miami for the second-longest streak this season, two behind Golden State's 12 -- has faced the Wolves twice this season with nine-game winning streaks. The Rockets escaped once in overtime before taking a loss in the second occasion. Minnesota will have to deal with emerging Heat center Hassan Whiteside, who went for 30 points, 20 rebounds and three blocks in Saturday's victory. He made 14-of-17 shots and grabbed six of his rebounds on the offensive end. \"I wanted to put some respect on my name,\" Whiteside said. Spoelstra added: \"He's been building...He's been playing very detailed, coherent, multiple-effort basketball during this whole stretch. \"This was the first time he put together the stats everyone wants to see from him. We were encouraged in previous games when he put up ordinary stats but did everything else at an exceptional level. , he put it all together.\" Towns is another center playing at a high level. He had his 10t straight double-double in Saturday's loss with 27 points and 16 rebounds. He has a double-double in 30 of his past 32 games and has tallied 27 20-point, 10-rebounds games this season, the third-most in the NBA. Towns tried to get Minnesota back into Sunday's game against the Memphis with 14 points in the fourth quarter. Afterward, he was frustrated with another loss. \"It doesn't matter if they sat three, two, one, zero, we have to pull out wins,\" Towns said. \"We played really well in the first quarter. Gotta stay disciplined. We gotta do what we gotta do to come out and scratch out wins.\"","Published\n\t\t            February 05, 2017",null,null,"job-152791-3-3",1486392857296.0,"foxbasic","Fox NewsHeat hope to build on 10-game streak at Minnesota",-1060609479]