["TamingnewsItem","McGuire, who runs Marcato Capital Management, has publicly agitated for changes at Buffalo Wild Wings since last July, demanding that the company franchise more of its restaurants.Marcato owned 5.2 percent of Buffalo Wild Wings shares as of Sept. 30, 2016, making it the company's fourth-largest shareholder. McGuire is among the four people Marcato nominated to the Buffalo Wild Wings board, which currently has nine directors.Buffalo Wild Wings said its board will review the slate of nominees but did not disclose when its annual shareholders' meeting would be held.Buffalo Wild Wings, with a market value of around $2.8 billion, caters to a sports crowd, with wide-screen televisions lining the walls of its dining and bar areas. Servers wear green-and-yellow sports jerseys with the number '82' on the sleeve, to commemorate the year the chain was founded.The company's stock rose 1.3 percent on Monday to $152 per share, about where it was trading a year ago. Marcato announced in December that it was entering talks with the company's franchise owners, saying they could have better access to innovations and grow more if the hedge fund's ideas were implemented. Marcato wants the chain to franchise out nearly all of its restaurants rather than owning them outright.Buffalo Wild Wings says it had 589 franchisee-owned and 601 company-owned restaurants as of Sept. 30, 2016.Marcato's slate includes Scott Bergen, the former chief executive of Yum Brands'  Pizza Hut, CTI Foods CEO Sam Rovit, and Lee Sanders, the former global chief development officer at TGI Fridays.San Francisco-based Marcato has also asked that Buffalo Wild Wings' management overhaul how it allocates capital and add people with relevant restaurant and finance experience to its management and board ranks.Buffalo Wild Wings has added three new directors to its board since last year, including a former Yum Brands chief financial officer. Last month, it expanded its share repurchase program by $400 million. ","Mon Feb 6, 2017 | 5:31pm EST","job-152791-1-9","job-152791-1-9","job-152791-1-9",1486424725064.0,"reutersbasic","Marcato nominates four directors in Buffalo Wild Wings fight",-1070000138]