["TamingnewsItem","The Justice Department on Friday signaled it stopped fighting to overturn a national injunction blocking the federal government from giving guidance to schools and transgender students, another sign President Donald Trump's administration is taking a different approach than former President Barack Obama's. A hearing was set for next Tuesday in the 5th Circuit Court of Appeals in which the Justice Department was fighting Texas and 11 other states, which had filed a lawsuit to prevent the Education Department from being able to give that guidance to transgender students that they are allowed to use restrooms that match their gender identity.But on Friday night the Justice Department and the states filed a joint notice saying both sides moved to cancel the hearing. \"The parties are currently considering how to best proceed in this appeal,\" the motion said.The Obama administration had argued not allowing transgender students to use the bathroom they choose is a violation of a law barring sexual discrimination.The states had won a national injunction, which still stands, preventing that guidance from being disseminated.Currently the injunction preventing the guidance from being given is nationwide. The Obama Administration had been asking the court to limit the scope of the injunction to the 12 states which are parties to the lawsuit.Besides the bathroom access issue, the guidance also covered making sure transgender students' privacy is protected.Activists of the LGBT community said the Justice Department move to cancel the hearing is not a good sign and believes it signals a shift in policy.\"It is sending a signal they don't intend to enforce the guidance in any state,\" Sarah Warbelow, legal director of the Human Rights Campaign, told CNN. \"They are fine with their hands being tied.\"The Justice Department declined comment on the filing.The move on this issue came one day after Jeff Sessions was sworn in as attorney general.Warbelow said she was \"extraordinarily disappointed. The DOJ should be a champion for all students' civil rights and by signaling a willingness to be bound by the injunction nationwide they ae certainly signaling they aren't intending to pursue civil rights for transgender people.\"Warbelow noted transgender students are not prohibited from filing a lawsuit if they experience discrimination.","Updated 6:44 PM ET, Sat February 11, 2017 ","http:\/\/rss.cnn.com\/rss\/cnn_latest.rss","http:\/\/www.cnn.com\/2017\/02\/11\/politics\/justice-department-transgender-guidance-case\/index.html","job-152791-2-25",1486861980940.0,"cnnbasic","Justice Department no longer fighting injunction on transgender school guidance",-1077344678]