["TamingnewsItem","President Trump continued his assault on mainstream polling on Monday morning, tweeting that any poll showing his controversial immigration ban is unpopular is “fake news” and asserting his internal statistics are superior.The tweets come as Trump tries to galvanize support for his orders placing restrictions on travelers from seven countries and pausing Syrian refugee resettlement. The Justice Department is currently fighting against a federal judge’s ruling halting those executive actions.“Any negative polls are fake news, just like the CNN, ABC, NBC polls in the election. Sorry, people want border security and extreme vetting,” Trump tweeted.Any negative polls are fake news, just like the CNN, ABC, NBC polls in the election. Sorry, people want border security and extreme vetting.He added: “I call my own shots, largely based on an accumulation of data, and everyone knows it. Some FAKE NEWS media, in order to marginalize, lies!”Any negative polls are fake news, just like the CNN, ABC, NBC polls in the election. Sorry, people want border security and extreme vetting.Trump’s early-morning slam of network polling came just days after a CNN\/ORC poll found 6-in-10 people opposed Trump’s planned wall on the Mexican border and 53 percent of respondents said they opposed Trump’s immigration executive order.Trump later blasted another favorite target -- The New York Times, which was featuring a prominent story about Trump and his senior staff members' \"early stumbles.\"\"The failing @nytimes writes total fiction concerning me. They have gotten it wrong for two years, and now are making up stories and sources!\" Trump wrote.The failing  writes total fiction concerning me. They have gotten it wrong for two years, and now are making up stories & sources!","Published\n\t\t            February 06, 2017",null,null,"job-152791-3-5",1486427966299.0,"foxbasic","Fox NewsTrump on immigration order's popularity: 'Negative polls are fake news'",-107171810]