["TamingnewsItem"," Greek Prime Minister Alexis Tsipras said on Saturday he believed the country's drawn-out bailout review would be completed positively but repeated that Athens would not accept \"illogical\" demands by its lenders.He warned all sides to \"be more careful towards a country that has been pillaged and people who have made, and are continuing to make, so many sacrifices in the name of Europe\".Greece and its international lenders made clear progress on Friday toward bridging differences over its fiscal path in coming years, moving closer to a deal that would secure new loan disbursements and save the country from default.\" will be completed, and it will be completed positively, without concessions in matters of principle,\" Tsipras told a meeting of his leftist Syriza party.Reaching agreement would release another tranche of funds from it latest 86 billion euro bailout, and facilitate Greece making a major 7.2 billion euro debt repayment this summer.European and International Monetary Fund lenders want Greece to make 1.8 billion euros - or 1 percent of GDP - worth of new reforms by 2018 and another 1.8 billion euros after then and the measures would be focused on broadening the tax base and on pension cutbacks.But further cutbacks, particularly to pensions which have already gone through 11 cuts since the start of the crisis in 2010, are hard to sell to a public worn down after years of austerity.Representatives of Greece's lenders are expected to return to Athens this week to report on whether Greece has complied with a second batch of reforms agreed under the current bailout, its third. \"We are ready to discuss anything within the framework of the  agreement and within reason, but not things beyond the framework of the agreement and beyond reason,\" Tsipras said. \"We will not discuss demands which are not backed up by logic and by numbers,\" he said.Tsipras accused the IMF, with which it has had testy relations since its first bailout in 2010, of being \"cowardly,\" and of coming up with \"new demands for Greece; absurd, imaginary unreal, it doesn't matter, as long as it is made to look like Greece is to blame ... for the already agreed decision of the Fund to not finance the third Greek bailout.\"The IMF has sat on the sidelines of the latest bailout program and says it cannot participate in a program which could keep Greece in a never-ending cycle of indebtedness that could push national borrowing to 275 percent of economic output by 2060.\"I don't know if  will be completed with the IMF having a central funding role, or a different role, but the review will be completed because Europe cannot afford to play games,\" Tsipras said. ","Sat Feb 11, 2017 | 8:10am EST","http:\/\/feeds.reuters.com\/reuters\/businessNews","http:\/\/www.reuters.com\/article\/us-eurozone-greece-tsipras-idUSKBN15Q0CT?feedType=RSS&feedName=businessNews","job-152791-1-24",1486829153351.0,"reutersbasic","Greece says bailout deal close, but will not accept 'illogical' demands",-1072011508]