["TamingnewsItem","“Life hacks” are addictive. Maybe you fixed a running toilet with a paperclip. Or you turned a ruddy old door into a makeshift coffee table. You looked at your invention with pride, because you foraged in the garage and jury-rigged something that worked.There are many “tech hacks” that offer simple solutions to everyday digital setbacks. Here is a list of my favorites. Most are easy and immediate, but there’s one to embrace your inner MacGyver that should take you a few hours.Be sure to watch the video demonstrations, so you won’t miss a step.Smartphone speakers aren’t very powerful, which is why most people connect their phones to earbuds or Bluetooth stereo gear to really enjoy their music and podcasts. But if you’re in a pinch for sound, place your phone into a dry cup or bowl and aim the speakers downward. You’ll be astonished how much louder your audio will sound. The hack takes only a second to set up. Just remember to use clean cups!Want to hear how much better it sounds? Wasn’t that fun? Let’s take it to the next level: You can make your own speakers. All you need is an empty cylinder, such as the cardboard tube you find in the middle of wrapping paper, a Pringle’s sleeve, or a two-liter soda bottle.Cut out a hole or add a notch that fits your smartphone’s body. Make sure you’re affixing the phone so that the speakers are facing into the tube. The sound will resonate inside the cylinder, and the increased volume and higher quality will surprise you.  If you’re feeling ambitious, you can use pretty much any building material, including PVC pipe.Remember, each material and shape will affect the sound differently. Most tablets get updated every year or two, so once you’ve purchased your most recent one, what do you do with the old device?You can turn some tablets into a digital picture frame, which you can place on any dresser or hearth. Show off your vacations and family photographs, and switch the scenery whenever you like.Simply load up a site like Photosnack, which pulls photos from your online accounts like Facebook and Flickr and automatically assembles a slideshow for you to enjoy.You can also use the photos already stored on your tablet and create an ongoing slideshow. Not sure how to do that? There are numerous dedicated slideshow apps that make it easy.Want even more uses for an old tablet? Would you believe you can use an old CD and a coat hanger to improve the Wi-Fi signal in your house? Sounds crazy, right?This trick is a little more sophisticated than dumping a phone in a bowl, but if you’re patient, you can pull it off. In addition to the CD and hanger, you’ll need a plastic CD case, a glue gun, a pair of wire strippers, and a coaxial cable.In short: You have to fashion an antenna out of the clothes hanger, which will look like an angular figure eight. Glue the CD to the plastic container it came in. Then stick the antenna onto one end of the coaxial cable and string the cable through the middle of the CD’s case.The final product should look like a miniature satellite dish. Normally, when you want to check the batteries in your remote control, you have to remove them. Maybe you have a tester, or maybe you just want to stick your double-As in another device.But if you have an iPhone, just switch on your camera and aim at the remote. Looking at the iPhone screen, you should see the tiny light that brightens when you press a button.A camera phone can register that light better than the naked eye, so if your remote has any energy left, your controller should emit a dim light. If you don’t see any light at all, that means your batteries are officially kaput.You’ve looked everywhere: the kitchen, the den, the car and even underneath the couch. But you can’t find your phone anywhere. There’s no one around, so you can’t ask someone to call you and listen for a ring tone.Luckily, you can turn to your Amazon Echo and say, “Alexa, trigger find my phone.” Echo will then call your phone, and you can follow the ringtone or vibration to its location.That’s not the only trick up Alexa’s sleeve. Curious what other tricks I have up my sleeve? Be sure to listen to or download my podcasts, or . You can listen to the  on your phone, tablet or computer. From buying advice to digital life issues, .","Published\n\t\t            February 04, 2017",null,null,"job-152791-3-3",1486392922494.0,"foxbasic","Fox News6 tech hacks you need in your life",-10732787]