["TamingnewsItem","Google and Facebook are partnering with journalists to help prevent fake news stories from spreading during France's presidential election. Google News Lab and the non-profit First Draft News have launched a verification project called \"CrossCheck\" that will help French newsrooms identify and quickly debunk hoaxes, rumors and other false claims.  At least 17 major news organizations are taking part in the project, including Le Monde, Agence France-Presse , Liberation, BuzzFeed and France Medias Monde, which manages Radio France Internationale and TV station France 24.  Google  and Facebook  will provide the journalists with tools to help identify misleading content. Google Trends and CrowdTangle, a Facebook tool that monitors social networks, will be used to scan for problematic stories.  Google will also train students from France's leading journalism schools in advanced search techniques that can be used to identify fake news.  The students will add context to each false claim and create a live feed of shareable report cards on the CrossCheck website. The feed will be overseen by the Agence-France Presse.  The public will also be able to submit questions and links to disputed stories. Their questions will be answered on a dedicated website.  Related: Did fake news influence Italy's referendum?  Google and Facebook both confirmed their participation in the project, but did not provide additional details.  The first round of French elections will be held on April 23. Marine Le Pen, leader of the far right National Front party, is well positioned to advance to the second round of the presidential contest. She is not, however, currently favored to triumph in the second round runoff.  Google and First Draft News partnered on a similar project during last year's U.S. presidential election. The initiative, called Electionland, was aimed at reporting evidence of voter suppression during the contest.  Related: How Europe's elections could be hacked  Misleading stories and flat out fake news have plagued social media during major elections around the world. Facebook, Google  and other companies have been under intense criticism over their approach to the problem.  Facebook is now attaching warning labels to made-up stories in some markets, and the company has taken steps to undercut the business model used by fake news publishers.  Related: Syrian refugee takes Facebook to court over fake news  First Draft News partners with newsrooms and other organizations to help them find, verify and publish content sourced from social media. CNN is a member of its partner network. "," February 6, 2017: 9:40 AM ET ","job-152791-2-8","job-152791-2-8","job-152791-2-8",1486422432469.0,"cnnbasic","Facebook, Google to help fight fake news ahead of French elections",-1086147587]