["TamingnewsItem","President Trump on Wednesday brought the legal dispute over his immigration executive order into the court of public opinion, using a Washington law enforcement address to mount an urgent defense of the measure and urge the federal courts to reinstate it. At a meeting with local sheriffs and police chiefs, the president said he issued the immigration order “for the security of our nation and so that people come in who aren't going to do us harm.” He added that the order was written simply and “so beautifully.”“A bad high school student would understand this,” he said. He spoke after a hearing late Tuesday during which the Justice Department presented its arguments to the San Francisco-based 9 Circuit Court of Appeals. The DOJ is fighting to overturn a Seattle judge’s decision to halt the controversial order that suspended the U.S. refugee program and immigration from seven mostly Muslim countries: Iraq, Iran, Syria, Yemen, Libya, Somalia and Sudan. Trump said he listened to the judges Tuesday and, while vowing not to comment specifically on the hearing, added: “I watched last night in amazement and I heard things I couldn’t believe.”“If they wanted to, in my opinion, help the court in terms of respect for the court, they’d be doing what they should be doing.” Supporters of Trump's order say it will help keep America safe from terrorists looking to infiltrate the United States from terror hotspots that often have inadequate vetting procedures. Opponents have argued it is unconstitutional and discriminatory – claiming that it is a “Muslim ban.”Trump has waded into the legal battle before, largely on Twitter. He recently called the judge who halted the order, James Robart, a “so-called judge” and earlier Wednesday warned on Twitter that “If the U.S. does not win this case as it so obviously should, we can never have the security and safety to which we are entitled.”At the meeting with police chiefs, he indicated he would be ready to criticize the appeals court if it ruled against his administration.\"I don't ever want to call a court biased, so I won’t call it biased and we haven’t had a decision yet, but courts seem to be so political,\" he said. “It would be so great for our justice system if they were able to read a statement and do what’s right and that’s to do with the security of our nation, which is so important.”","Published\n\t\t            February 08, 2017",null,null,"job-152791-3-11",1486570386001.0,"foxbasic","Fox NewsTrump mounts public defense of immigration order, blasts ‘political’ courts",-1080711666]