["TamingnewsItem","House Democrats vowed Wednesday to oppose President Trump at essentially every turn, using their annual retreat to plot ways to keep public pressure on Republicans despite wielding limited power on Capitol Hill. With GOP lawmakers already facing constituent backlash over efforts to repeal and replace ObamaCare without an alternative at the ready, Democrats acknowledged that grassroots efforts like engaging and organizing voters are essential to their opposition.\"I think that's the most powerful tool the Democrats have,\" California Rep. Linda Sanchez, vice chairwoman of the House Democratic Caucus, said Wednesday in Baltimore, at the group’s annual retreat. \"We're going to keep stoking the fires,\" New Jersey Rep. Frank Pallone said. The ObamaCare debate is heating up even before GOP leaders present their plan. This past weekend, California Rep. Tom McClintock had to be escorted by police from a town hall event as protesters upset about potentially losing their insurance shouted, \"Shame on you!\"The episode, and GOP Rep. Gus Bilirakis having faced a similar situation in Florida, resulted in House Republicans on Tuesday discussing how to protect themselves and staffers, according to Politico. Pallone made clear Wednesday, though, that Democrats are not actively encouraging voters to disrupt GOP town halls, saying that is \"not actually allowed.\"  On Wednesday, Democrats acknowledged the challenge of dealing with a Republican in the White House and GOP-controlled House and Senate, but insisted they are far from demoralized.“These conferences are an opportunity to come together as a party and chart a united path forward,” said caucus Chairman Joe Crowley, of New York. “The fight before us is tough, is a difficult one, but a fight worth having.”House Minority Leader Nancy Pelosi, D-Calif., reiterated her familiar attack lines, alleging Republican plans to dismantle ObamaCare are a recipe to “make America sick again,” while offering little optimism about any bipartisan compromise – though former President Barack Obama openly challenged Republicans to come up with a better alternative if they could.And Pelosi again pressed Trump to release his tax returns, send Congress a budget bill and come clean on his connection to Russian President Vladimir Putin, following intelligence community findings that Moscow meddled in the 2016 White House campaign Trump won over Democrat Hillary Clinton. Trump has said he doesn’t know Putin.“What on earth does Russia have on President Trump?” Pelosi asked. “As long as  continues down this path, there’s nothing Democrats can work with him on.”Crowley suggested the House Democrats will challenge GOP leadership by employing all possible legislative tactics including procedural votes.  “The most powerful tools in Congress are to hold Republicans accountable,” he said.","Published\n\t\t            February 09, 2017","http:\/\/feeds.foxnews.com\/foxnews\/politics","http:\/\/www.foxnews.com\/politics\/2017\/02\/09\/house-dems-plot-tactics-for-battling-obamacare-repeal-gop-agenda.html","job-152791-3-13",1486632129818.0,"foxbasic","Fox NewsHouse Dems plot tactics for battling ObamaCare repeal, GOP agenda",-1091114795]