["TamingnewsItem","The toymaker's shares rose nearly 9 percent to $90.00 in premarket trading on Monday, on track to open at a record high.  Larger rival Mattel Inc's  stock was up about 2 percent at $26.27. Hasbro won the lucrative contract for dolls based on Disney's princesses such as Cinderella and Snow White from Mattel in 2014 and started selling the toys in 2016.  The company said revenue from toys in the girls category jumped 52 percent, as demand for dolls based on Walt Disney Co's  Cinderella and Frozen rose significantly in the fourth quarter ended Dec. 25. Global sales of its board games also rose 11 percent, driven by demand for its franchise brand Magic: The Gathering and also Pie Face. The company also benefited from strong demand for dolls based on DreamWorks' \"Trolls\" movie, which was released in the United States in November. HOLIDAY-QUARTER WOES Hasbro is the first toymaker to report strong quarterly results despite a weak holiday season. Demand for toys rose only 5 percent, compared with the estimate of 6.5 percent, hurt by increased promotional activity, intense competition and a slump in consumer purchases in the first three weeks of December, according to industry research firm The NPD Group. Jakks Pacific Inc  reported dismal holiday-quarter results in December. Retailer Toys \"R\" Us Inc also reported a 3.4 percent decline in same-store sales in January, highlighting a very promotional environment.  Mattel, the No. 1 U.S. toymaker, posted disappointing quarterly sales and profit in January, citing a \"significant U.S. toy category slowdown in the holiday period.\" Hasbro's revenue rose 11.2 percent to $1.63 billion, beating analysts' average estimate of $1.50 billion, according to Thomson Reuters I\/B\/E\/S.  Net income attributable to Hasbro rose to $192.73 million, or $1.52 per share, in the quarter, from $175.76 million, or $1.39 per share, a year earlier.  Excluding certain items, the Pawtucket, Rhode Island-based company earned $1.64 per share. Analysts on average had expected $1.12.  ","Mon Feb 6, 2017 | 8:05am EST",null,null,"job-152791-1-7",1486395127093.0,"reutersbasic","Hasbro bucks glum holiday trend with strong profit, sales beat",-1099075371]