["TamingnewsItem","Nimo Hashi feels like a single mother -- even though she's been married for more than three years. Hashi, 24, is a Somali refugee raising her 2-year-old daughter alone, working nights in a Utah factory that makes sports drinks. The last time she saw her husband was in 2014, in the Ethiopian refugee camp where they ended up after fleeing civil war in Somalia.Hashi gained approval that year to come to America; her husband, 29-year-old Abdelsalam Ahmed, did not -- he'd have to wait years for his application to clear. With Hashi pregnant, the two decided she should travel ahead to the United States without him, always believing they'd be reunited. \"I imagine a couple living together in happiness,\" Hashi told CNN through a translator. \"With my husband helping me raise the family.\"Nearly three years later, Hashi's dream for a complete family was about to come true: Ahmed was coming to America to reunite with his wife and meet his daughter Taslim. Then came the  signed by President Donald Trump, halting travel from seven Muslim-majority countries. The order included a 120-day ban on refugee travel into the United States, sending thousands like Hashi's family into limbo.\"I wasn't sure where I was going that day. I didn't even know what I was doing at work,\" Hashi said. \"I was very confused, not sure how long I'd live this life of loneliness without the support of my husband. And I'm still concerned not knowing if this is my reality.\" Hashi's story is not unique. In Utah, there have been 69 cases of travelers affected by the ban, according to refugee resettlement groups -- many involving families from Afghanistan, Iraq and several African nations. \"The impact was so devastating for those families,\" said Aden Batar of Catholic Community Services in Salt Lake City, himself a former refugee. In 1994, he says, his family was the first from Somalia to resettle in Utah.Now, Batar has dedicated his life to helping incoming refugees, plotting dates and flight numbers on a whiteboard and coordinating welcome teams to greet them at the airport. That work ground to a halt on January 27, and Batar's whiteboard was marked all over with one word: \"canceled.\"\"My hands were shaking because I know that's how these families' lives will be affected by canceling those flights,\" Batar said. \"I know what it takes to be a refugee waiting in the refugee camps. It's not right.\"While immigration is often viewed as an issue that divides the nation along party lines, many Utah Republicans have expressed empathy for refugees affected by the executive order.\"People think we've broken ranks here, I don't know what that means,\" Utah's Republican Gov. Gary Herbert said. He agrees with President Trump's right to review overall immigration policy, but is convinced that Utah's refugee program is safe and necessary. \"We understand the persecution aspect that they're trying to leave behind,\" Herbert said, alluding to the targeted anti-Mormon violence that originally brought members of that faith to settle in Utah. \"Maybe that makes us more sensitive to the issue, maybe a little more empathetic. Nevertheless, we ought to look for opportunities to improve people's lives.\"Balloons, welcome posters and a roaring crowd -- not the usual scene at Salt Lake City International Airport.Last week more than 100 Utahns welcomed refugees arriving from Afghanistan. Linda Dewey was in tears as the refugee family entered the terminal flanked by the cheering crowd. \"It makes me so happy to see they made it, and so sad that others aren't,\" she told CNN affiliate .Now, with the 9th Circuit Court's stay of the travel ban, Hashi hopes the next wave of joy is for her family. Ahmed is scheduled to fly in Friday morning.\"Until I see my husband at the Salt Lake City airport, I'm not going to believe that he's going to come,\" she said.But the thought of her daughter having her father home brings an overwhelming feeling of hope. \"I'm always dreaming about that. With the will of God .\" ","Updated 0317 GMT  February 9, 2017 ","http:\/\/rss.cnn.com\/rss\/cnn_latest.rss","http:\/\/www.cnn.com\/2017\/02\/08\/us\/somali-refugees-travel-ban\/index.html","job-152791-2-17",1486629583408.0,"cnnbasic","Travel ban prolongs Somali refugee family's separation",-1107382027]