["TamingnewsItem","By 2025, the number of white high school graduates will have dropped 6 percent, while their Hispanic counterparts will have risen as much as 43 percent, a new report is predicting.The results of the research by the Western Interstate Commission for Higher Education  were released Tuesday in a report titled “Knocking at the College Door\" and It was conducted by a 15-state commission that has studied the demographics of high school graduates for decades. According to it, the peak of about 3.47 million high school graduates  reached in 2013 is something of the past. that universities will have to rethink recruitment practices moving into the future, to better pursue students who may be the first in their families to receive degrees.“We are moving toward a time when nearly half of all high school graduates will be students of color, with the largest increases among Hispanics and Asian\/Pacific Islanders,” said Joseph Garcia, president of WICHE, to “Meanwhile, as our population continues to shift geographically, the states that will gain the most population will educate the highest percentage of students of color.”In the 1990s, the steady stream of high school grads offered a solid pipeline for colleges and universities serving traditional students between the ages of 18 to 22, according to the WICHE report.But now states in the Midwest and Northeast, which have an abundance of colleges, are facing a declining number of high school graduates. Meanwhile, in the south and west, the opposite problem exists. In Texas for example, high school graduates are projected to rise 19 percent from 2013 to 2025.“It puts some of these institutions at risk,” Garcia said Monday. With the number of private school graduates and white students ebbing in many places, he said, colleges that relied for generations on certain “feeder schools” could be forced to get creative.“You can’t use your same old techniques,” he said. “You need to change your approach.”Jeff Strohl, director of research for Georgetown University’s Center on Education and the Workforce, cited federal data showing that the share of recent high school graduates enrolled in college fell from 70.1 percent in 2009 to 65.9 percent in 2013, according to the Washington Post.According to a new study, the boom of nearly 3.5 million U.S. high school graduates in 2013 is coming to an abrupt end -- with the exception of Hispanic students -- who are projected to rise to 43 percent by 2025, while the number of white grads will fall 6 percent.The new report from the Western Interstate Commission for Higher Education  released Tuesday is titled, .\" It was created by a 15-state commission who has studied the demographics of high school graduates for decades. This recent report is the first update to that research in four years.The results indicate that universities will have to rethink recruitment practices moving into the future, to better pursue students who may be the first in their families to receive degrees.“We are moving toward a time when nearly half of all high school graduates will be students of color, with the largest increases among Hispanics and Asian\/Pacific Islanders,” said Joe Garcia, president of WICHE. “Meanwhile, as our population continues to shift geographically, the states that will gain the most population will educate the highest percentage of students of color.”In the 1990s, the steady stream of high school grads offered a solid pipeline for schools serving traditional students between the ages of 18 to 22, based on reporting by the . States in such areas as the Midwest and Northeast, have an abundance of colleges and a declining number of high school graduates. Whereas in the South and West, the opposite problem exists. In Texas for example, high school graduates are projected to rise 19 percent from 2013 to 2025.“It puts some of these institutions at risk,” Garcia said Monday. With the number of private school graduates and white students ebbing in many places, he said, colleges that relied for generations on certain “feeder schools” could be forced to get creative.“You can’t use your same old techniques,” he said. “You need to change your approach.”Jeff Strohl, director of research for Georgetown University’s Center on Education and the Workforce,  that federal data shows that the share of recent high school graduates enrolled in college fell from 70.1 percent in 2009 to 65.9 percent in 2013.“ are going to need to spread their enrollment and recruiting activities outside of the places they’ve already gone,” Strohl said.","Published\n\t\t            December 06, 2016","http:\/\/feeds.foxnews.com\/foxnews\/section\/lifestyle","http:\/\/www.foxnews.com\/lifestyle\/2016\/12\/06\/report-by-2025-rate-white-high-school-graduates-will-drop-6-hispanics-will-rise.html","job-152791-3-23",1486919925735.0,"foxbasic","Fox NewsReport: Hispanic high school graduates to increase 43% by 2025 - and a 6% drop for whites",-1104600528]