["TamingnewsItem","We watch our televisions, and in many cases our televisions watch us back. That's the backdrop to the news this week that Vizio has agreed to settle charges that it violated the law by using software in its \"smart,\" internet-connected TVs to collect data on what users were watching, without permission.The software told Vizio what consumers were playing on their TVs, whether it came from broadcast or cable channels, streaming services, DVD players, or other sources. The company also collected data on users' WiFi networks and mobile devices that were linked wirelessly to the televisions.   Other makers of internet-connected TVs, including Samsung and LG, track their users' viewing habits, too. But unlike Vizio, those companies require people to nominally agree to the practice by clicking OK to a privacy policy during setup. Consumer Reports has been writing about this technology, which is often called  , since 2015, and since then it has only become more widespread.Like the details of what you like on Facebook or search using Google, information collected by TV makers can be sold to big data brokers who compile consumer information for sale to marketers.ACR data also can be harnessed to target television viewers with specific ads—a practice that consumers are used to on the web but that's just getting started in the television world.In a statement emailed to Consumer Reports, Vizio sought to clarify its actions.\"The ACR program never paired viewing data with personally identifiable information such as name or contact information, and the Commission did not allege or contend otherwise,\" Vizio wrote. \"Instead, as the Complaint notes, the practices challenged by the government related only to the use of viewing data in the ‘aggregate’ to create summary reports measuring viewing audiences or behaviors.\"Regardless of how such data is being used, you might prefer to keep your viewing habits to yourself. There's a way to turn off this kind of user tracking in every smart TV we've tested. Here are instructions on how to do that with Vizio, Samsung, and LG televisions, the leading brands in the U.S.Vizio has used more than one system for content recognition, but the feature's name has been consistent: Smart Interactivity.As of yesterday, Vizio's updated privacy policy for viewing data states that the capability has been disabled on its TVs. If you want to be safe by turning off the feature manually, the procedure depends on which Vizio set you own.Almost all of Vizio's new TVs now use the Google-powered . To turn off Smart Interactivity, open the Vizio app on a mobile device, find Settings, and click on Reset & Admin. Now you can use the onscreen slider button to turn off the feature.Older models, plus newer D-series sets, use a platform called Vizio Internet Apps . Go to the System setting. In a menu called Reset & Admin, highlight Smart Interactivity and press the right arrow to disable the ACR. On , click the Settings icon in the main menu, look for Support, then scroll down to Terms & Policies. There are several options, including Viewing Information Services, Voice Recognition Services, and Nuance Voice Recognition and Privacy Notices. You can choose not to accept any of them. Then disable the Internet-based Advertising feature. Turning off the voice-related services will inhibit your use of voice-controlled functions with the TV, but you won't notice any difference when you simply opt out of \"viewing information services.\"On older Samsung smart TVs, the ACR controls are found under the TVs' Smart Hub menu. Look for the icon for Settings, click on Support, and find the submenu titled Terms & Policy. Choose SyncPlus and Marketing, where there's an option to disable the feature. Turning off Voice Recognition Services will disable voice control, a feature that sends your voice commands to a third-party vendor for processing.On LG's newer webOS TVs, click on the icon for Settings from the main menu, then scroll down until you see General. Look for the About This TV submenu, and click on User Agreements. There are three options to consider: Viewing Information, Personal Advertising, and Voice Information. You can choose to opt out of all of these features. Turning off the voice option will inhibit your use of voice-controlled features, but the other two options won't affect performance.It's a bit easier on older LG TVs. Go to Settings, find Options, then open LivePlus, LG's version of ACR. Once there, you can toggle the feature on and off.LG tells us that it will be updating its 2016 and 2017 smart TVs later this year so that there will be a LivePlus option in the menu that can be toggled on and off.One final note: Even though you can opt out of these data-collection features, most smart TV manufacturers note that they'll still continue to receive some non-identifying information from your smart TV. This, they say, is needed to provide TV basic functions. So even if your TV isn't outright snooping, it may still be sniffing.Copyright © 2005-2017 Consumers Union of U.S., Inc. No reproduction, in whole or in part, without written permission. Consumer Reports has no relationship with any advertisers on this site.","Published\n\t\t            February 08, 2017","http:\/\/feeds.foxnews.com\/foxnews\/tech","http:\/\/www.foxnews.com\/tech\/2017\/02\/08\/how-to-turn-off-smart-tv-snooping-features.html","job-152791-3-13",1486632078254.0,"foxbasic","Fox NewsHow to Turn Off Smart TV Snooping Features",-1107054989]