["TamingnewsItem","Yolanda ticks off the countries she and her husband have passed through in the last three months: Brazil, Peru, Ecuador, Colombia, Panama and now Costa Rica. But she is no tourist. \"A lot of roads, lots of bus rides, and a lot of walking too,\" she tells CNN, agreeing to be interviewed but asking that we only use her first name and not show her face. \"For a 7-month pregnant woman, that is a long, long time.\"Yolanda says she is originally from Congo. She and her husband are among tens of thousands of migrants -- many from Africa and Haiti -- criss-crossing South and Central America trying to reach the United States.Now they're stuck in the border town of Paso Canoas, Costa Rica, waiting for the travel documents that will let them enter the country and continue their journey northward. \"I hope to leave soon, for my turn to come fast so I can see a doctor,\" she says. \"I don't want my baby to be born on the road.\"Long an obligatory stop on an important trade and tourist route, Paso Canoas has seen an unprecedented influx of migrants trekking north in recent months. The huge surge in undocumented arrivals is a logistical and humanitarian nightmare for the government of Costa Rica. \"At this moment Costa Rica is absolutely overwhelmed with our immigration situation and we're doing our best to protect the human rights of the people who are coming,\" said Mauricio Herrera Ulloa, the Costa Rican Communications Minister and point person for the migration crisis. \"No one was prepared or was thinking about the possibility that we would receive 10,000 people from Haiti or Africa.\"Since April, when Costa Rica first started issuing transit visas for undocumented migrants, more than 18,000 people have crossed the border into the country. There are no comparative figures because the demand simply wasn't there in previous years so the visas didn't exist, officials say. It is a situation that is being replicated in border towns throughout the Americas. Experts say migrants are risking their lives in perilous journeys that expose them to crime and hunger and leave them vulnerable to human trafficking.\"They offer  something that they really need and in the case of these people, what they really need is to get one more border north,\" says Cy Winter, director of border management for the International Organization for Migration .That means they often pay so-called coyotes for illegal border crossings -- breaking their ties to the state and public administration system. They often fall prey to false job offers \"just over the border.\" \"But then, on the other side, what's arranged there is completely different,\" says Winter. \"So they end up in a place where they have to work and they've got no way to get away from it.\" The IOM and other experts believe the majority of migrants are Haitians, many of them pretending to be Congolese in order to avoid deportation since it would be too costly for most Latin American countries to fly them to Africa. And in both Haiti and Congo, French is spoken. \"The people I've spoken to claiming to be from Congo, barely know the capital and don't know the dialects that are spoken in the Congo and don't know the football jersey,\" said Winter. According to the US Secretary of Homeland Security, some 40,000 Haitian migrants are working their way north, already overwhelming many border crossings into the United States. Many of them entered Brazil as legal refugees after the 2010 earthquake. But the economic crisis in Brazil has made it increasingly difficult for migrants to get jobs, sparking an exodus.\"We've seen accumulations of up to 5,000 people on the border in various countries in South America so it is a concerning uptick in arrivals,\" said Winter. One migrant I met on the Panamanian-Costa Rican border told me that every single one of the dozens of \"Congolese\" migrants milling about the migration office was actually from Haiti. \"Here, Congo isn't a country, it's a password,\" he said, explaining that he and others destroy their passports so that they can re-invent themselves. The bottlenecks at borders have raised serious concerns. The IOM has begun offering workshops at schools like Colegio Progreso -- in Panama, just across the border from Paso Canoas -- teaching students about the connection between migration and human trafficking. In the past, the school was used as a shelter for hundreds of Cubans trying to make their way to the United States. The regional school director says she heard stories of women turning to prostitution in desperation. \"In relation to the people being trafficked, we've heard horror stories,\" said Flor Bonilla. In San Jose, the capital of Costa Rica, Marilia Morales is just as worried. She founded the non-profit  20 years ago to rescue, rehabilitate and support survivors of sexual exploitation. Now she's launching a project on Costa Rica's northern border with Nicaragua. \"We have an avalanche of people coming, we have Africans, Haitians, we have people coming from a lot of places,\" Morales told CNN. \"We are in the process of training our personnel and we are going to be working with this community directly because they have to be aware that they could be victims of human trafficking, either for slave labor, sexual slavery and other ends,\" she said. Nicaragua has closed its borders to undocumented migrants forcing thousands on the border into deplorable makeshift shelters and tent villages. On Costa Rica's southern border, officials are trying to process migrants as quickly as possible. They're admitting 100-200 a day, but there is a long waiting list.In Yolanda's case, her hopes for a quick trip through Costa Rica were quickly dashed. Upon arrival, she was told she would have to wait six weeks just for an appointment with immigration officials. Without the laissez-passer, she and her husband can't access the shelters set up by authorities in conjunction with the Red Cross -- warehouses and schools where migrants get free meals and a mattress to sleep on. For the time being, they are sleeping in a makeshift hostel just a short walk from the border. They pay $5 a day and squeeze in with some 50 other people. Yolanda says she left Congo for Brazil, where she worked in a restaurant for a year. She says both she and her husband lost their jobs in the recession -- just as they discovered she was pregnant. Now, their dream is for their daughter to be born in the United States. But the odds are not in their favor. The money they borrowed from family back home is running out and she says they can't ask for more. While Yolanda says she is from Congo, when I first met her, she couldn't at first remember or pronounce what she said was her hometown: Brazzaville, the capital of Congo.  When the time came to say goodbye to Yolanda and her husband, I couldn't help but wonder where they came from, and where this journey will ultimately take them. Unfortunately for Haitians trying to make their way into the United States, officials recently eliminated the generous benefits and easy entry that were established after the 2010 earthquake. Which means that even if they make it to the US border after months of travel and hardship, neither Haitian nor Congolese migrants are likely to get in. ","Updated 1653 GMT  December 21, 2016 ","job-152791-2-9","job-152791-2-9","job-152791-2-9",1486425530635.0,"cnnbasic","The other migrant crisis: Thousands risk journey through Latin America",-1102420889]