["TamingnewsItem","**Want FOX News Halftime Report in your inbox every day? Sign up .**  Two years ago, ObamaCare was a political disaster. Today, it is more popular than it has ever been.The Real Clear Politics  on approval for the law shows opposition down 11 points in the last year and the latest Fox News  support for the law actually outpacing opposition by 4 points.What had been a thrice-successful election strategy for Republicans has turned into a policy millstone for the GOP at the very moment the party assumes total control of Washington.So what gives?It’s only February and we are already hearing at least the fourth iteration of the party’s strategy for when to repeal and replace the law. Not the actual contents of the replacement mind you, but just the question of to break ground on the project., who campaigned ferociously against the law, stunned casual observers when in his  after winning the White House said he wanted to maintain some key components.Then, House Speaker  unveiled a plan that essentially called for repealing the law immediately but delaying its removal for years while Republicans sorted out their specific replacement. Given Trump’s  that there be no disruptions in coverage for any beneficiaries of the existing law, it seemed to many like the only reasonable means of escape.The delayed replacement plan was of particular political appeal since it would allow Republicans to keep their promise to base voters by voting to “repeal” the law but not open themselves up to Democratic attacks over lost coverage. It would be the reverse of what Democrats did in imposing the law: eat dessert first and wait to eat your veggies.But, just as “repeal and replace” seemed to have given way to “repeal and eventually replace,” conservatives in Congress kicked up a godawful racket about a bait-and-switch, alleging that the leadership would either never get around to replacing or wait until a time when Republicans had less political leverage and use that to cram down conservative demands.Sen. , R-Ky., led the charge on the right against symbolic repeal and eventual replacement and  Trump to the cause. And the next week, Trump  for concurrent repeal and replacement and doing so “very quickly.” Or so it seemed.Ryan, accordingly, turned the ship about and days later promised that the House would meet the demands of the conservatives, now backed by Trump, and . It was a huge legislative marker and one that Ryan acknowledged would wipe out hopes for quick action on other priorities.Those priorities include two of Trump’s favorites aimed at kick-starting the economy: big tax cuts and a deficit-fueled $1 trillion infrastructure package. Ryan said  that those big ticket items would have to wait until at least the spring as the House choked down the ObamaCare legislation.That all brings us to the president’s interview with Bill O’Reilly that aired ahead of the Super Bowl. Asked about repealing and replacing, Trump  that the replacement process will be “very complicated” and may stretch into 2018.And that’s the year those on the right were worried about in the first place, since election-year pressures would make passage of a more conservative replacement – if any at all – less likely.Which brings us back to square one.After eight years of relentless focus on the issue, how can it be that Republicans are in such a quandary over what to do about the law? Let’s go back to the stunning turnaround in those ObamaCare polls to explain why.ObamaCare was always mostly unpopular, but for different reasons. As , who is better at reading the crosstabs than picking football games,  a consistent component of the opposition was from the left – those who thought the law did not go .Republicans mostly imagined that ObamaCare opposition was monolithically opposed to the law as an expensive intrusion of the federal government. But there were consistently between 10 and 20 percent of folks who wanted the law to be more liberal than it was.What are those people going to say when the discussion shifts from replacing or changing ObamaCare under a Democratic administration to a Republican one? Given the choice between keeping something that in their minds doesn’t go far enough or replacing it with something far more conservative, of course liberals would glom on to the law.And remember, this is all before the nitty gritty policy committee gets to the work of describing what is and isn’t in the replacement plan. By the time Republicans are done, they could see their plan looking far worse than ObamaCare in polls. Remember, they’ll be losing support among their base voters, just as  saw  and others attack his law from the left. No wonder the GOP is all tangled up.But while Republicans are dithering over when and how to do the deed, the decision may be made for them. As Trump pointed out in the interview, the law is already coming undone. Much of it stems from existing problems with the law, but  is also blowing up the abutments that are keeping ObamaCare alive. These decisions, made at the agency level, have set a countdown clock to doomsday.While the GOP is jabbering about the most politically advantageous time to act, the decision may be made for them. And the only thing worse than being seen as confused about something so important as Americans’ health care is being unprepared in the face of a crisis you helped precipitate. “The powers delegated by the proposed Constitution to the federal government are few and defined. Those which are to remain in the State governments are numerous and indefinite.” – : “SOMERVILLE, Mass. - Fluff turns 100 this year, and the marshmallow concoction that has been smeared on a century’s worth of schoolchildren’s sandwiches has inspired a festival and other sticky remembrances…In 1917, Montreal-born confectioner   crafted the original recipe in his Somerville home. Query is said to have whipped up the first batches in his own kitchen before selling it door to door. Following World War I there was a sugar shortage in the U.S., so Query sold the recipe for $500 to two war veterans,  and . The recipe has stayed with Durkee Mower Inc. ever since. It’s the only product the family-owned company makes. In 1920, Durkee and Mower began producing and selling Fluff, which they first named Toot Sweet Marshmallow Fluff. The company moved to a factory in East Lynn, Massachusetts, in 1929. The original recipe hasn’t changed: corn syrup, sugar syrup, dried egg whites and vanillin.” Email us at  with your tips, comments or questions: “Several Republican lawmakers sought Sunday to distance themselves from President Trump’s comments he made about Russian President Vladimir Putin, made during an . Trump has long expressed his desire to mend the relationship with Russia. When told by O’Reilly that the Russian leader is a “killer,” Trump replied that the U.S. has killers too. ‘What do you think? Our country's so innocent?’ Trump said during the taped interview broadcast during Sunday's Super Bowl pregame show…Senate Majority Leader  , R-Ky., immediately looked to distance himself from Trump’s comments in an interview on CNN’s ‘State of the Union.’ ‘Putin's a former KGB agent. He's a thug. He was not elected in a way that most people would consider a credible election,’ he said…Sen.  , R-Neb., who is also one of Trump’s Republican critics, said on ABC’s ‘The Week’ that ‘there is no moral equivalency between the United States of America, the greatest freedom living nation in the history of the world, and the murderous thugs that are in Putin's defense of his cronyism.’” : “President Donald Trump made his first visit to the headquarters Monday for U.S. Central Command and U.S. Special Operations Command. A room full of troops in fatigues from the Army, Navy, Air Force and Marines awaited the president, who was scheduled to join them for lunch, along with senior members of his White House staff. At MacDill, the president is to be briefed by CENTCOM and SOCOM leaders, join troops for lunch and deliver a speech. Gen.  , the chairman of the Joint Chiefs of Staff, and  , Trump’s national security adviser, were expected to attend the meetings.” : “Donald Trump's unpredictable foreign policy could hamper longstanding U.S. intelligence-sharing partnerships as countries react to a president who seeks closer ties to Russia and is unafraid to offend American allies by cracking down on immigration or getting angry with friendly leaders. Veteran spies say intelligence relationships are built to weather storms between political leaders. Even in the worst of times, allies share intelligence to thwart threats. But the lack of understanding about Trump's foreign policy direction and his potential new friendship with Moscow are creating jitters across the Western world.” : “As an appeals court reviews his travel ban from seven Muslim countries, President Trump claimed Monday that the public is with him. ‘Any negative polls are fake news, just like the CNN, ABC, NBC polls in the election,’ Trump tweeted. ‘Sorry, people want border security and extreme vetting.’ Polls are more equivocal on the Trump order that blocked travel from seven Muslim majority countries, causing delays, long lines, and general chaos at airports nationwide last month. After a federal judge in Seattle struck down the order, the Trump administration has appealed to the 9th U.S. Circuit Court of Appeals…”: “Lawyers for Minnesota and Washington state told a federal appellate court Monday that it would ‘unleash chaos’ if it lifted an order temporarily halting President Trump’s ban on refugees and travelers from seven predominantly Muslims countries from entering the U.S. The states said in briefs filed with the San Francisco-based 9th U.S. Circuit Court of Appeals that Trump’s travel ban harmed residents, businesses and universities and stated that the ban was unconstitutional. The legal maneuvers by the two states were accompanied by briefs filed by the technology industry arguing that the travel ban would harm their companies by making it more difficult to recruit employees. Tech giants Apple and Google, along with Uber, filed their arguments with the court late Sunday.” Former Deputy Attorney General  , a Bush political appointee, says that although he supports broad use of executive action he questions Trump’s knowledge of his Constitutional limits. : “Faced with President Trump’s executive orders suspending immigration from several Muslim nations and ordering the building of a border wall, and his threats to terminate the North American Free Trade Agreement, even , our nation’s most ardent proponent of executive power, would be worried by now.” “Needs to slow down on the gum chewing; way too many pieces in there” –         “Good info but must take exception on two statements. The election was not very winnable for Democrats. The people were tired and fed up with liberal politicians and Democrats had no desirable candidates to choose from. Also the statement that Trump’s temporary ban on immigrants was unpopular is inaccurate. Polls show that more people approve than disapprove.” –   “If Senator McConnell decides to ‘Go Nuclear’ in regard to the Gorsuch nomination when does he have declare it? I really enjoy your daily missive.” –   “My brother informed me that my memory was faulty and my grandfather grew up in Bluefield, W. Va., not Redfield-guess I am too much of a Republican to think blue. In any event his favorite hunting spot was on or near the banks of the Bluestone River. Worked at the Pocahontas Coal Mine. Said he had a good coonhound that was swimming after a coon die from drowning after the coon climbed up on its back and held it under.” –   Email us at  and please make sure to include your name and hometown. … : “On Friday, the Forest Grove Police Department announced on Facebook they had finally apprehended a troublesome potbelly pig. According to the post, the pig, known as ‘Piggy Smalls’  had ‘allegedly been harassing residents in the Hawthorne neighborhood of Forest Grove over the last several months.’ He was ultimately captured at a little before 1 p.m. ‘by a joint task force of the FGPD Code Enforcement Officer and a representative of Home Sweet Home Properties.’ The pig has been terrorizing the neighborhood for months. In November, Smalls was the suspect in  in just one edition of the weekly Forest Grove Police log. Smalls frequently eluded capture. According to the Forest Grove Police, ‘Smalls will be released to the custody of an animal rescue outside the city.’ Good luck with that.” Chris Stirewalt joined Fox News Channel  in July of 2010 and serves as digital politics editor based in Washington, D.C.  Additionally, he authors the daily \"Fox News First\" political news note and hosts \"Power Play,\" a feature video series, on FoxNews.com. Stirewalt makes frequent appearances on the network, including \"The Kelly File,\" \"Special Report with Bret Baier,\" and \"Fox News Sunday with Chris Wallace.\"  He also provides expert political analysis for Fox News coverage of state, congressional and presidential elections.","Published\n\t\t            February 06, 2017",null,null,"job-152791-3-5",1486427974573.0,"foxbasic","Fox NewsHow Republicans got into the ObamaCare quagmire",-1103531978]