["TamingnewsItem","While the modern hiker may spend days trekking miles up mountains, over rivers and through the woods, many of today's trekkers opt to skip toting their own packs and setting up camp at day's end. The more fabulous hikes often end with a gourmet meal and a trained massage therapist kneading out knots on a lodge's private terrace.Hiking has gone high-end.Adventure travel sales have climbed in the last year, according to a new study out by international luxury travel network Virtuoso, and hiking and trekking topped the list of preferred activities by adventure travelers.\"More and more, people of all ages are realizing the benefits of an active lifestyle,\" said Ange Wallace, a travel advisor at Wallace Pierson Travel, a Virtuoso agency in Amelia Island, Florida. \"The infrastructure of many of the world's more remote and beautifully untouched places has grown to support the desire for comfort after the physicality of the day.\"Not every traveler who wants to hike is the rugged, tent-pitching type.  That's why high-end outdoor tour operator Gray & Co -- named world's best tour operator by Travel + Leisure this year -- started creating custom wellness-based vacations that don't have to end with campground sleepovers.  \"People like the idea of sweating by day, but they still want to be really comfortable at night,\" Gray & Co founder Cari Gray said.Some 45% of the company's planned trips include a hiking component, and interest in hiking is up 10 percent over last year, Gray said. \"People want to disconnect from their everyday world, and certainly luxury outdoor experiences allow that.\"Here's a look at some of the hottest luxe hikes happening around the world.Think of as a full-time concierge of sorts -- one that would coordinate the private copter pick-up at the end of a hike so seamlessly as to deliver the adventurer back to their lodge right in time to catch the sunset. Travelers have been increasingly interested in Iceland, where trips can include a trek across lava fields, glacier climbing and bathing in natural hot springs. Guests staying at  -- one of the most lavish lodges in Iceland -- can heli-ski to the 3,000-foot mountain summits right outside their door. The day's fatigue can be quickly worked out at Deplar's spa, where six different treatment rooms are available to guests.With its beloved blue-footed booby and sought out exclusivity, the Galapagos has long been calling eco-travelers. But now the gem of Ecuador is adding more adventure to its repertoire. Most people can't say they flew to isolated volcanic isles and boarded a yacht to get to their hiking trail, but those are the bragging rights offered by .As part of a seven-night cruise, travelers can hike daily at each island on their itinerary, with an expert guide leading the way through lava fields, along beaches, cliffs and around mangroves, with wildlife spotting along the way. Back on the yacht, count grilled Basque-style octopus with roasted peppers and Ecuadorian encebollado  with fresh sliced tuna and yuca chips among the options for eats.The happiest hike could easily be one that ends with wine. As part of the Wine and Wellness tour at  in Napa Valley, the day starts with a three-mile hike through the grapevines, past working farms making the region's premium vinos and the Napa River. For lunch, hikers pick their own produce from the garden for the resident chef to cook up, and gourmet vineyard-to-table dishes like flatbread with grilled garden veggies, estate honey and green olive tapenade are served. The pros pouring the wine describe the thinking behind the pairings. Recipes can be taken to go for those who want to recreate the pairing at home, sans hike.For a twist on the classic Caribbean vacation, get thee to . Near the eco-luxury villa resort in Dominica, where beach gives way to jungle, trekkers can explore the longest hiking trail in the Caribbean, the Waitukubuli National Trail. As part of the resort's Peak Adventures package, hikers are supplied with plenty of exertion friendly provisions to bring along on the day's adventures. Expeditions could include treks past bubbling sulphur mud pools in Dominica's Valley of Desolation or hiking to the grey-blue water of the Boiling Lake in Morne Trois Pitons National Park, the island's World Heritage Site. At the end of the day, a wellness specialist awaits with a massage to restore the body..Even the lavender fields of Provence are fodder for fancy hikes these days. With , travelers can walk the purple pastures until they tire or find themselves at the lavender distilleries to get some essential oils. At the end of a hike, which covers easy to moderate terrain and as many as eight miles per day, an evening hosted by a local master cheese-maker pairs bites with local vintage wines from vineyards along the trek. Nights are passed in intimate inns or estates of former French aristocrats from the 1700s.Terrain goes from glacial to whitewater to forests on  Trails of Patagonia Tour. The luxury tour operator gives travelers adventure without the logistical struggle. A private guide meets guests at their alpine lodge after breakfast and takes them on an ice trek to the top of Perito Moreno Glacier on the Argentine side of Patagonia one day, with glimpses of the surreal Mount Fitz Roy and a lake full of flamingos as a backdrop. Heading to the Chilean side another day, trekkers are escorted to Puerto Natales for a look at the slowed pace of Patagonian life before trekking into Torres del Paine National Park. ","Updated 1658 GMT  September 12, 2016 ","job-152791-2-9","job-152791-2-9","job-152791-2-9",1486427387081.0,"cnnbasic","High-end hikes step up adventure",-1114045598]