["TamingnewsItem","Researchers examined data on more than 18,000 women with breast malignancies and 184,000 women the same age without breast cancer. They found breast density appeared to be the biggest indicator of cancer risk, even more than other common risk factors like family history or waiting until after age 30 to have babies. “Women with dense breasts have a roughly 2-fold higher breast cancer risk relative to women with non-dense breasts,” said lead study author Dr. Natalie Engmann of the University of California, San Francisco. This is a problem because 60 percent of younger women have dense breasts and so do 40 percent of older women who have gone through menopause – and because dense breasts make tumors harder to detect on mammograms, Engmann said. “Our findings suggest that because breast density is a strong, common risk factor that can be modified, reducing the number of women with dense breasts may prevent a substantial proportion of breast cancer cases,” Engmann added by email. The results don’t mean that breast density would be the most meaningful risk factor for every woman, however. Rather, from an epidemiology standpoint they explain many cancer cases in the general population because so many women have dense breasts. In the study, researchers examined data on women with four categories of breast density: almost entirely fat, mostly fat with some dense tissue, moderately dense and predominantly dense. Then, they looked at several known breast cancer risk factors: women’s weight, family history of the disease, personal history of benign biopsy results, breast density and having a first baby after age 30. About 39 percent of breast cancer cases before menopause and 26 percent of cases afterwards might be prevented if women in the two highest breast-density categories had less dense breast tissue, the study team calculated.There isn’t much women can do to reduce breast density, the authors acknowledge. One drug, tamoxifen, reduces cancer risk and breast density but it has serious side effects and generally isn’t recommended to women unless they have a high risk of cancer.Gaining weight tends to add fatty tissue to the breasts and lower density, but obesity is independently tied to an elevated risk of breast cancer in older women, the study also found. In fact, roughly 23 percent of breast cancers in older women might be prevented if overweight or obese women shed enough pounds to achieve a healthy weight, the researchers also calculated. Still, compared to breast density or obesity, some other common risk factors didn’t appear to explain as many cancer cases in the general population. Family history was linked to about 9 percent of cases for younger women and 8 percent in older women, for example, while delayed childbirth was tied to 9 percent of cases for younger women and 5 percent for older women. One limitation of the study is that it didn’t look at certain risk factors like genetic mutations that can greatly increase the odds of breast cancer for individual women, the authors note. Only 5 percent to 10 percent of breast cancers diagnosed in the U.S. are due to inherited gene mutations linked to breast cancer, according to the National Cancer Institute . Women with these mutations, however, are much more likely to develop cancer, and to have aggressive tumors that are hard to treat. It’s unclear that women can do anything to reduce breast density, but it may make sense for them to consider screening alternatives to mammograms, said Dr. Christine Berg, a NCI researcher who wasn’t involved in the study. “I think it makes more sense for a woman with dense breasts, particularly with other risk factors, to discuss with her doctor and the radiologist whether or not she would benefit from other types of screening such as MRI,” Berg said by email. “Breast tomosynthesis is an emerging technology which I think is better than standard mammography.”Berg also recommended a calculator  developed by the Breast Cancer Surveillance Consortium for women to assess their individual risk.SOURCE:  JAMA Oncology, online February 2, 2017.","Wed Feb 8, 2017 | 6:11pm EST","http:\/\/feeds.reuters.com\/reuters\/healthNews","http:\/\/www.reuters.com\/article\/us-health-breastcancer-risk-density-idUSKBN15N2UG?feedType=RSS&feedName=healthNews","job-152791-1-16",1486600829175.0,"reutersbasic","Dense breasts may be leading risk factor for breast cancer",-1113462652]