["TamingnewsItem","Three federal judges Tuesday evening will hear oral arguments in the challenge to President Donald Trump's executive order on immigration.The hour-long hearing, conducted by telephone among three West coast judges at 6 p.m. ET, will determine the immediate fate of the nationwide temporary restraining order against Trump's travel ban.Trump has only been in office for 17 days, but his Justice Department is already embroiled in a high-stakes legal battle that could affect hundreds of thousands of people and the direction of his presidency.Attorneys general for Washington and Minnesota, which challenged the executive order, say that the temporary restraining order should remain in place because the President had \"unleashed chaos\" by signing the order.Trump, who rode a wave of populist anger into the White House, now has to wait for the Ninth Circuit panel. The San Francisco-based court has a reputation as one of the most liberal in the nation to the point where some Republican lawmakers have even pushed to split it up in an effort to limit its impact. And no matter what its ruling here, the next stop will likely be the US Supreme Court. It's a stunning escalation of an issue that has caused massive confusion in airports across the country, left those with valid visas and refugees seeking asylum in legal limbo and prompted the President himself -- in the first major legal challenge of his presidency -- to who ruled against him.The issue in front of the court at the moment is not whether or not Trump's travel ban is constitutional, but whether it will remain suspended for now.It all centers on his executive order issued January 27 with little explanation or advance warning. The  -- Iraq, Syria, Iran, Libya, Somalia, Sudan and Yemen -- from entering the US for 90 days, all refugees for 120 days and indefinitely halts refugees from Syria.Friday, federal Judge James Robart of the US District Court for the Western District of Washington . Trump fired off . In one he referred to Robart as a \"so called\" judge. In another, he said, \"Just cannot believe a judge would put our country in such peril. If something happens blame him and court system. People pouring in. Bad!\"The two states' attorneys general put forward several legal arguments, including that it violates the Establishment Clause in the First Amendment to the Constitution because it shows government preference for one religion over another, and Equal Protection Clause -- part of the 14th Amendment -- because it discriminates based on religion and national origin.The government counters that Robart's injunction should be lifted for now and the executive order should be cleared to go back into effect while the legal process continues.Hawaii also sought to get in on the action early Monday morning -- filing an emergency motion to intervene in the appeal. The state's attorney general filed a separate lawsuit against Trump over the travel ban in federal district court in Hawaii last week, and it now argues that Hawaii must be allowed in the case before the Ninth Circuit to protect its interests as well.Also on Monday morning several former senior US officials, including former Secretaries of State John Kerry and Madeleine Albright, signed on to a declaration in support of a brief filed by the attorneys general of Washington state and Minnesota.\"We view the  Order as one that ultimately undermines the national security of the United States, rather than making us safer,\" officials wrote.\"It could do long-term damage to our national security and foreign policy interest, endangering US troops in the field and disrupting counterterrorism and national security partnerships.\"The top legal officials in 16 states, including Pennsylvania and Iowa which voted for Trump, . The state attorneys general from these states argue they have standing as the executive order inflicts harm on states, including disruption at state universities and medical institutions. The states include New York, California, Connecticut, Delaware, Iowa, Illinois, Maine, Maryland, New Mexico, Oregon, Rhode Island, and Vermont, the Commonwealths of Massachusetts, Pennsylvania, and Virginia, as well as the District of Columbia.The appellate court has been burning the midnight oil, requesting further briefing early Sunday on the Justice Department's request for an emergency stay from the two states -- Washington and Minnesota -- as well as from the government. The states ask that the court to leave the temporary restraining order in place, arguing that the government has failed to show that it would be \"irreparably harmed\" by a suspension of the executive order. \"But that would mean that until the  Order was issued, Defendants were suffering some unspecified, ongoing irreparable harm. That makes no sense. ... Preserving the status quo against sudden disruption is often in the interest of all parties,\" the states said in a court filing Monday morning.Monday evening, the Justice Department responded.\"The Executive Order is a lawful exercise of the President's authority over the entry of aliens into the United States and the admission of refugees,\" the Justice Department wrote in a brief Monday evening.The government struck back Sunday, arguing that Robart's order should be lifted and the executive order go back into effect. \"Judicial second-guessing of the President's determination that a temporary suspension of entry of certain classes of aliens was necessary at this time to protect national security would constitute an impermissible intrusion on the political branches' plenary constitutional authority over foreign affairs, national security, and immigration,\" wrote Noel Francisco, the acting Solicitor General.The three-judge panel includes Judge William C. Canby Jr, an appointee of President Jimmy Carter, Judge Michelle T. Friedland, who was appointed by President Barack Obama, and Judge Richard R. Clifton, an appointee of President George W. Bush. It is likely that they will make their decisions based on the legal briefs they receive and not ask for a hearing.The 9th Circuit represents the most geographically diverse district in the country with nearly four dozen judges and covers most of the western United States, Hawaii and Alaska. The loser at the 9th Circuit will most likely go to the Supreme Court. Because the justices are understaffed with only eight judges, there is a chance that they could split on the ruling 4-4.If that were to occur, they'd be left with simply upholding whatever order the 9th Circuit issued, underscoring the importance of that court's ruling.CNN's Laura Jarrett and Joe Sutton contributed to this report.","Updated 2350 GMT  February 6, 2017 ","job-152791-2-9","job-152791-2-9","job-152791-2-9",1486425668485.0,"cnnbasic","9th Circuit Court of Appeals to hear challenge to Trump's ban Tuesday",-1119264798]