["TamingnewsItem"," Toshiba Corp favors private equity bidders in the sale of a stake in its chip business, as suitors including rivals SK Hynix Inc and Micron Technology Inc vie with financial investors like Bain Capital, sources said on Tuesday.Toshiba needs to raise funds by the end of March to offset an imminent multi-billion dollar writedown on its U.S. nuclear power business, meaning there may not be enough time to conclude a deal with another chipmaker, said one of the sources with direct knowledge of the company's strategy.That plan, initially at least, would confound attempts by other chipmakers to buy a slice of a business that may provide an edge in the booming market for NAND flash memory chips used for long-term data storage.Another of the sources said Toshiba could eventually seek investment from other chipmakers once its financial crisis had passed.South Korea's Hynix, the world's No. 2 chipmaker, on Tuesday said it had submitted a non-binding bid although it gave no details on the size of the stake it wanted to acquire.SK Hynix and Bain Capital declined to comment and Toshiba said it could not comment on specifics of the sale process. U.S. chip group Micron Technology was not immediately available for comment.Toshiba's chip rivals would benefit from the Japanese firm's technological know-how in high-end NAND products and a boost in chip supply, analysts said. Toshiba is the world's second-largest maker of flash memory.Interest in the stake is heating up with sources telling Reuters that bids had also come from investment funds, California-based data storage company Western Digital Corp and Micron Technology, amid a surge in memory chip prices. The world's biggest maker of flash memory, Samsung Electronics Co Ltd, was not among the bidders, the sources said.As smartphones and data servers demand ever more processing firepower, chip suppliers are struggling to keep pace with demand. Nomura estimates global memory sales will grow 56.7 percent this year to a record $116 billion, and the NAND segment to expand 51.2 percent to $51 billion.    Toshiba aims to raise more than 200 billion yen  from the less-than 20 percent stake in its memory business, sources have said. ANTI-TRUST CONCERNSelling the stake to an investment fund could speed up the process by eliminating anti-trust concerns surrounding other chipmakers, particularly Western Digital which is both a rival of Toshiba's and a business partner.While a handful of firms including Samsung, SK Hynix and Toshiba control the memory industry, SK Hynix's overall market share was not high enough to pose an antitrust hurdle, said Claire Kyung-min Kim, analyst at Daishin Securities.Investing in Toshiba could allow the South Korean firm to defend its turf against potential Chinese rivals, she said. Tsinghua Unigroup Ltd, China's top state chip manufacturer, in January unveiled a plan to build a $30 billion memory chip factory and tried unsuccessfully in 2015 to acquire Micron Technology.\"If a Chinese firm buys a stake in Toshiba it would be a risk for all other memory makers,\" Kim said.SK Hynix reported record quarterly revenue in October-December and is now South Korea's second-largest firm by market capitalization behind Samsung Electronics.    In December it announced a 2.2 trillion won  investment in a new NAND plant in South Korea, hoping to catch up with rivals' more advanced production technologies.SK Hynix shares rose 0.3 percent on Tuesday, while Toshiba's were down by 0.3 percent.  ","Tue Feb 7, 2017 | 2:27am EST","job-152791-1-11","job-152791-1-11","job-152791-1-11",1486458697381.0,"reutersbasic","Toshiba courts funds as SK Hynix, Micron Technology bid for chip stake: sources",-1111940922]