["TamingnewsItem","Our Terms of Service and Privacy Policy have changed.Aviation industry executives are heading to the White House Thursday morning for their first meeting with President Trump, carrying a wish list of often conflicting priorities. Trump is the first president to have a background in the travel industry, having run both an airline and a hotel empire. And during the campaign, Trump lamented the condition of the country's airports.  \"You land at LaGuardia, you land at Kennedy, you land at LAX, you land at Newark,\" Trump said during the first presidential debate. \"We've become a third world country.\"  The executives are hoping to find a receptive ear as they discuss airport infrastructure, aviation's impact on jobs, air traffic modernization, tax and regulatory reform and a host of other issues.  Related: US airlines' cautious reaction to Trump's immigration order  They have tailored their message to President's \"America First\" agenda, even if the airlines and airports are on different sides of an issue. New airport terminals are needed to restore American infrastructure. Restricting foreign airlines protects U.S. airline jobs. But allowing foreign airlines to expand helps the sale of Boeing jets and aids U.S. manufacturing jobs.  The chief executives of Delta Air Lines , United Airlines , Southwest Airlines , JetBlue Airways  and Alaska Airlines  are expected to attend. Executives from cargo carriers FedEx , UPS  and Atlas Air  will be in attendance, as will officials from the trade association Airlines for America.  Airport officials are also expected, representing Los Angeles, Chicago, New York City, Washington, D.C., Tampa, Fla., Buffalo, N.Y. and Nashville, Tennessee, according to two people familiar with the meeting.  American Airlines CEO, Doug Parker, will not attend due to an annual company leadership retreat in Dallas.  Related: Are America's airports going to be great again?  The meeting is another in a series President Trump has held with industry leaders.  \"I think there are areas of common ground\" among the airlines, such as new airport infrastructure development and government taxes and fees on airline tickets, said Robert Mann, principal at R.W. Mann &amp; Company, an airline industry consultancy.  One airline official says the industry feels stifled by regulations, complaining \"we have to report to the FAA what movies we want to play onboard a flight.\"  But the airlines arrive at 1600 Pennsylvania Ave. on Thursday polarized around key issues.  Deliberately off the official agenda is a discussion of the Open Skies Agreements that have allowed three Middle Eastern airlines in Qatar and the United Arab Emirates to rapidly expand to U.S. destinations, said one of the people familiar with the meeting.  The three biggest U.S. carriers - Delta, American and United - have loudly objected to the expansion, claiming the Middle Eastern airlines have unfairly benefited from national subsidies. The carriers refute the claim and the U.S. airlines want the State Department to review the agreement that allows unfettered flying.  The issue has split the airline community. FedEx, Atlas Air, JetBlue and Hawaiian Airlines want to preserve the status quo. Both sides are taking their case to Secretary of State Rex Tillerson.  Related: American airlines want Trump to take on their Gulf rivals  The White House has sent few signals about how it feels about aviation issues, but Press Secretary Sean Spicer Tuesday appeared unwilling to block low cost carrier Norwegian Air Shuttle's expansion from Europe into the U.S.  That has roiled U.S. carriers and labor unions concerned about an unfair advantage for Norwegian that they claim could cost them their jobs. Norwegian is also one of Boeing's fastest-growing customers, and it has more than 100 new jets on order, worth billions of dollars and supporting tens of thousands of U.S. manufacturing jobs. Boeing will not be at the White House meeting.  \"There is a huge economic interest that America has in that deal right now,\" said Spicer.  CNN's Rene Marsh contributed to this report. "," February 8, 2017: 10:07 PM ET ","http:\/\/rss.cnn.com\/rss\/cnn_latest.rss","http:\/\/money.cnn.com\/2017\/02\/08\/news\/companies\/aviation-execs-trump-meeting\/index.html","job-152791-2-17",1486629522302.0,"cnnbasic","Aviation execs carrying wish list to Trump meeting",-111854712]