["TamingnewsItem","President Donald Trump said Friday afternoon he was unaware of reports that his national security adviser, Michael Flynn, may have spoken about sanctions with the Russian ambassador before the inauguration.Trump, speaking to reporters aboard Air Force One, said he will \"look into that.\"A US official confirmed to CNN late Friday afternoon that Flynn and the Russian ambassador, Sergey Kislyak, did speak about sanctions, among other matters, during the call.The context of Flynn's side of the conversation wasn't clear, even to the FBI and intelligence agencies that reviewed the content, and there's nothing to indicate that Flynn made any promises or acted improperly in the discussion. Flynn cannot rule out that he spoke to Kislyak about sanctions, an aide close to the national security adviser said earlier Friday.Flynn, the aide said, has \"no recollection of discussing sanctions,\" but added that the national security adviser \"couldn't be certain that the topic never came up.\"Earlier Friday, a senior White House adviser told CNN that Vice President Mike Pence did not know that Flynn may have discussed sanctions in the December conversation and believes \"it's a problem.\"Three administration officials said Pence only knew what Flynn told him -- that he had not talked about sanctions -- before Pence stood before cameras last month and vouched for Flynn. One official said Pence was trying to \"get to the bottom of it,\" and two senior administration officials said Pence was \"very intentional\" in asking Flynn about his communication with the Russians before speaking to the media.A source with knowledge of the situation told CNN the only reason Flynn hasn't been fired is that the White House doesn't want to look bad. Adding to Flynn's problems, the source said, is that this latest revelation reflects poorly on Pence.Flynn has avoided making firm commitments about maintaining US sanctions on Russia, according to US and European officials familiar with his meetings in recent weeks.Even as the Trump administration maintains publicly that it will keep in place sanctions on Russia over its incursion into Ukraine, White House officials, including Flynn, are offering less committal signals behind closed doors, according to these sources.\"We're getting mixed messages\" on Russia, a senior western diplomat who has met with Flynn recently told CNN, going on to suggest that while State Department officials are adamant that sanctions will remain in place until Russia withdraws from Crimea, those closer to Trump at the White House are offering less certain assurances.Those sources told CNN both Ukraine-related sanctions, and the set of sanctions related to Russia's cyber-meddling in the US election, are on the table for review, according to their discussions with Trump administration officials.The Kremlin denied Friday reports that Flynn discussed sanctions on Russia in recent discussions with Russia's ambassador to Washington.When asked about a  published Thursday that Flynn and Kislyak discussed US sanctions on Russia -- and that these discussions may have influenced President Vladimir Putin's decision not to retaliate to the sanctions -- Kremlin spokesman Dmitry Peskov said \"the information is incorrect.\"\"If I understand the communication between Flynn and Kislyak correctly, there have been some talks. If I understand correctly,\" Peskov said.  \"As for the rest, the information is incorrect,\" he added.According to another person who met recently with members of Trump's national security team, Secretary of State Rex Tillerson echoed previous public assurances that sanctions enacted on Russia for its Ukraine actions would remain in place. But Flynn seemed to be on a different page, suggesting that Trump is seeking areas for cooperation with Russia.Last week, US Ambassador to the United Nations Nikki Haley offered a tough stance on Russia's actions in Ukraine, where violence has escalated in recent weeks.\"The United States continues to condemn and call for an immediate end to the Russian occupation of Crimea,\" Haley said during her first set of remarks at the UN Security Council. \"Crimea is a part of Ukraine. Our Crimea-related sanctions will remain in place until Russia returns control over the peninsula to Ukraine.\"A source familiar with Haley's speech told CNN's Dana Bash at the time that the White House was well aware of what she was going to say, though didn't receive explicit direction from Trump's close circle of advisers on how to address the issue of Crimea in her remarks.The source said that Haley made clear in private conversations, as well as during her confirmation hearings, how she felt about global hot spots like Russia. In some areas, her point of view differed from Trump's, who as a candidate hinted he might recognize Russia's annexation of Crimea. Asked last month whether he would maintain Crimea-related sanctions on Russia, Trump demurred, saying it was \"too early\" to discuss sanctions.And last weekend, Pence also refused to say the Ukraine-related sanctions would remain firmly in place.\"I think that's a question that will be answered in the months ahead. And it just simply all depends...on whether or not we see the kind of changes in posture by Russia,\" he said on ABC. \"And the opportunity perhaps to work on common interests. And the president's made it clear the top priority of this administration is to hunt down and destroy ISIS at its source.\"Maine Sen. Angus King is on the Intelligence Committee and plans to further investigate Russia's interactions with members of the Trump campaign during the 2016 election.\"I think that's very important information,\" he told CNN's Alisyn Camerota on \"New Day.\" \"As far as where this issue goes with Michael Flynn, I don't see it as necessarily something that's a crime or anything. But it does go to questions of credibility and judgment.\"New York Rep. Chris Collins said he is not bothered by Flynn's potentially illegal activity.\"No, it doesn't bother me. I'm thrilled  the team President Trump has put together,\" the Republican, who is Trump's congressional liaison, said. \"I know General Flynn personally and he's a man of integrity who is always going to put our country first.\"\"I'm just an individual that happens to know the players and trusts them implicitly and know they are always putting America's best interests first and only first,\" he added.Law enforcement and intelligence officials  that calls between Flynn and Kislyak were being scrutinized by investigators as part of a broader counterintelligence investigation of Russian activities in the US. Officials stressed last month that there was no determination of any wrongdoing. The calls were captured by routine US eavesdropping targeting Russian diplomats, according to the intelligence and law enforcement officials. ","Updated 0022 GMT  February 11, 2017 ","http:\/\/rss.cnn.com\/rss\/cnn_latest.rss","http:\/\/www.cnn.com\/2017\/02\/10\/politics\/flynn-russia-us-sanctions-reports\/index.html","job-152791-2-22",1486774021472.0,"cnnbasic","Trump says he's unaware of reports Flynn discussed sanctions with Russian ambassador",-1112257962]